[
  {
    "_id": "68183cb8f8e721138d29a490",
    "Job URL": "https://www.naukri.com/job-listings-data-analyst-ascendion-engineering-bengaluru-7-to-11-years-280425918824",
    "Application Type": "Internal",
    "Company Name": "Data analytical company",
    "Experience Required": "7-11 Yrs",
    "Job Description": "We are seeking a Data Analyst with strong SQL, Python, and Tableau skills to join our team. You will be responsible for extracting insights from data, automating workflows, and creating dashboards to support business decision-making.\nKey Responsibilities:\nWrite and optimize SQL queries for data extraction and analysis.\nUse Python (e.g., Pandas, Airflow) to automate processes and analyze data.\nBuild and maintain interactive Tableau dashboards.\nCommunicate data insights effectively to both technical and non-technical stakeholders.\n6+ years of relevant experience.\nQualifications:\nStrong experience with SQL and Python.\nProficiency in Tableau for creating visual reports.\nExcellent analytical and communication skills.\nAbility to collaborate with cross-functional teams.",
    "Job Title": "Data Analyst",
    "Location": "Remote",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-05T04:18:34.657Z",
    "Search Experience": "1",
    "Search Location": "Bangalore",
    "Search Query": "Data Analyst",
    "Skills": "Airflow, Tableau, Python, sql, azure, data frame, Microsoft Azure, Data analysis",
    "firstScraped": "2025-05-05T04:21:11.999Z",
    "lastUpdated": "2025-05-05T04:21:11.999Z"
  },
  {
    "_id": "68183cb8f8e721138d29a48f",
    "Job URL": "https://www.naukri.com/job-listings-data-analyst-ascendion-engineering-bengaluru-8-to-13-years-280425920582",
    "Application Type": "Internal",
    "Company Name": "Ascendion",
    "Experience Required": "8-13 Yrs",
    "Job Description": "Minimum of 5+ years of professional experience in a data-driven, finance analytical role\nDemonstrated previous proficiency in SQL and Tableau and experience with Python/R to be tested during technical interviews\nExperience in quantitative analysis\nDemonstrated strong communication skills\nStrong data storytelling skills, including the ability to distill technical insights into a clear and compelling narrative\nExperience building intuitive dashboards using Tableau producing actionable data insights\nExperience working independently and as a member of a cross-functional team\nHands on previous professional experience in finance analytics, preferably at a SaaS subscription based company\nExperience with dbt is a bonus\nAbility to deliver results independently or with minimal supervision\nNetwork with senior internal and external personnel within your area of expertise\nReadily take on difficult challenges and approach them with a sense of urgency\nDemonstrate good judgment in selecting methods and techniques for obtaining solutions",
    "Job Title": "Data Analyst",
    "Location": "Remote",
    "Salary": "20-27.5 Lacs PA",
    "Scraped Date": "2025-05-05T04:17:05.195Z",
    "Search Experience": "1",
    "Search Location": "Bangalore",
    "Search Query": "Data Analyst",
    "Skills": "Data Analyst, Tableau, Python, SQL, SFDC, Finance, Pandas, Numpy, Salesforce",
    "firstScraped": "2025-05-05T04:21:11.999Z",
    "lastUpdated": "2025-05-05T04:21:11.999Z"
  },
  {
    "_id": "68183cb8f8e721138d29a48e",
    "Job URL": "https://www.naukri.com/job-listings-data-analyst-natwest-group-bengaluru-6-to-11-years-010525501904",
    "Application Type": "Internal",
    "Company Name": "NatWest Markets",
    "Experience Required": "6-11 Yrs",
    "Job Description": "Join us as a Data Analyst\nTake on a new challenge in a cutting edge data team, in which you ll contribute to the analysis of complex bank, franchise or function data to identify business issues and opportunities\nWe ll look to you to provide high quality analytical input to help develop and implement innovative processes and resolve problems across the bank\nThis is a hands on role in which youll hone your data analysis expertise and gain valuable experience in a dynamic area of our business\nWere offering role at associate level\nWhat youll do\nAs a Data Analyst, youll play a key role in supporting the delivery of high quality business solutions. You ll be performing data extraction, storage, manipulation, processing and analysis, alongside developing and performing standard queries to ensure data quality and identify data inconsistencies and missing dat\nDay-to-day, you ll also be:\nContribute to the analysis of complex organisational, franchise or function data to identify business issues and opportunities, supporting the delivery of high quality business solutions.\nManaging the analysis of complex bank, franchise or function data to identify business issues and opportunities, supporting the delivery of high quality business solutions.\nContribute to the analysis of complex organisational, franchise or function data to identify business issues and opportunities, supporting the delivery of high quality business solutions\nThe skills youll need\nWe re looking for someone with experience of using data analysis tools and delivering data analysis in a technology or IT function.\nWe ll also look for:\nMinimum 6 years of experience in IT Industry and minimum 4 years into the Data Analyst Role\nProvide high quality analytical input to support the development and implementation of innovative processes and problem resolution\nSupport with a number of large, complex and critical projects\nUndertake analysis of data to identify business issues and opportunities\nExperience in Banking (Transaction Monitoring) and Payments\nGood knowledge and experience in SQL",
    "Job Title": "Data Analyst",
    "Location": "Bengaluru",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-05T04:16:57.041Z",
    "Search Experience": "1",
    "Search Location": "Bangalore",
    "Search Query": "Data Analyst",
    "Skills": "Data analysis, Analytical, Banking, Manager Technology, Data quality, Data Analyst, Business solutions, Monitoring, SQL, Data extraction",
    "firstScraped": "2025-05-05T04:21:11.999Z",
    "lastUpdated": "2025-05-05T04:21:11.999Z"
  },
  {
    "_id": "68183cb8f8e721138d29a48d",
    "Job URL": "https://www.naukri.com/job-listings-data-analyst-national-westminster-bank-natwest-bengaluru-6-to-8-years-010525502659",
    "Application Type": "Internal",
    "Company Name": "Natwest Services",
    "Experience Required": "6-8 Yrs",
    "Job Description": "Join us as a Data Analyst\nTake on a new challenge in a cutting edge data team, in which you ll contribute to the analysis of complex bank, franchise or function data to identify business issues and opportunities\nWe ll look to you to provide high quality analytical input to help develop and implement innovative processes and resolve problems across the bank\nThis is a hands on role in which youll hone your data analysis expertise and gain valuable experience in a dynamic area of our business\nWere offering role at associate level\nWhat youll do\nAs a Data Analyst, youll play a key role in supporting the delivery of high quality business solutions. You ll be performing data extraction, storage, manipulation, processing and analysis, alongside developing and performing standard queries to ensure data quality and identify data inconsistencies and missing dat\nDay-to-day, you ll also be:\nContribute to the analysis of complex organisational, franchise or function data to identify business issues and opportunities, supporting the delivery of high quality business solutions.\nManaging the analysis of complex bank, franchise or function data to identify business issues and opportunities, supporting the delivery of high quality business solutions.\nContribute to the analysis of complex organisational, franchise or function data to identify business issues and opportunities, supporting the delivery of high quality business solutions\nThe skills youll need\nWe re looking for someone with experience of using data analysis tools and delivering data analysis in a technology or IT function.\nWe ll also look for:\nMinimum 6 years of experience in IT Industry and minimum 4 years into the Data Analyst Role\nProvide high quality analytical input to support the development and implementation of innovative processes and problem resolution\nSupport with a number of large, complex and critical projects\nUndertake analysis of data to identify business issues and opportunities\nExperience in Banking (Transaction Monitoring) and Payments\nGood knowledge and experience in SQL",
    "Job Title": "Data Analyst",
    "Location": "Bengaluru",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-05T04:14:39.952Z",
    "Search Experience": "1",
    "Search Location": "Bangalore",
    "Search Query": "Data Analyst",
    "Skills": "Data analysis, Analytical, Banking, Manager Technology, Data quality, Data Analyst, Business solutions, Monitoring, SQL, Data extraction",
    "firstScraped": "2025-05-05T04:21:11.999Z",
    "lastUpdated": "2025-05-05T04:21:11.999Z"
  },
  {
    "_id": "68183cb8f8e721138d29a48c",
    "Job URL": "https://www.naukri.com/job-listings-data-analyst-capgemini-technology-services-india-limited-bengaluru-2-to-5-years-220425911467",
    "Application Type": "Internal",
    "Company Name": "Capgemini",
    "Experience Required": "2-5 Yrs",
    "Job Description": "About The Role  \n\nWorks in the area of Software Engineering, which encompasses the development, maintenance and optimization of software solutions/applications.\n1. Applies scientific methods to analyse and solve software engineering problems.\n2. He/she is responsible for the development and application of software engineering practice and knowledge, in research, design, development and maintenance.\n3. His/her work requires the exercise of original thought and judgement and the ability to supervise the technical and administrative work of other software engineers.\n4. The software engineer builds skills and expertise of his/her software engineering discipline to reach standard software engineer skills expectations for the applicable role, as defined in Professional Communities.\n5. The software engineer collaborates and acts as team player with other software engineers and stakeholders.\nWorks in the area of Software Engineering, which encompasses the development, maintenance and optimization of software solutions/applications.1. Applies scientific methods to analyse and solve software engineering problems.2. He/she is responsible for the development and application of software engineering practice and knowledge, in research, design, development and maintenance.3. His/her work requires the exercise of original thought and judgement and the ability to supervise the technical and administrative work of other software engineers.4. The software engineer builds skills and expertise of his/her software engineering discipline to reach standard software engineer skills expectations for the applicable role, as defined in Professional Communities.5. The software engineer collaborates and acts as team player with other software engineers and stakeholders.\n\n About The Role - Grade Specific \nIs highly respected, experienced and trusted. Masters all phases of the software development lifecycle and applies innovation and industrialization. Shows a clear dedication and commitment to business objectives and responsibilities and to the group as a whole. Operates with no supervision in highly complex environments and takes responsibility for a substantial aspect of Capgeminis activity. Is able to manage difficult and complex situations calmly and professionally. Considers the bigger picture when making decisions and demonstrates a clear understanding of commercial and negotiating principles in less-easy situations. Focuses on developing long term partnerships with clients. Demonstrates leadership that balances business, technical and people objectives. Plays a significant part in the recruitment and development of people.\n\n Skills (competencies) \n\nVerbal Communication",
    "Job Title": "Data Analyst",
    "Location": "Bengaluru",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-05T04:14:31.914Z",
    "Search Experience": "1",
    "Search Location": "Bangalore",
    "Search Query": "Data Analyst",
    "Skills": "data analysis, business analysis, sql, tableau, technical support, python, project management, software development, windows installation, presales, software installation, software troubleshooting, product management, desktop engineering, computer hardware, agile",
    "firstScraped": "2025-05-05T04:21:11.999Z",
    "lastUpdated": "2025-05-05T04:21:11.999Z"
  },
  {
    "_id": "68183cb8f8e721138d29a48b",
    "Job URL": "https://www.naukri.com/job-listings-isc-c-bom-data-analyst-alstom-transport-india-ltd-bengaluru-3-to-6-years-250425915355",
    "Application Type": "Internal",
    "Company Name": "Alstom Transportation",
    "Experience Required": "3-6 Yrs",
    "Job Description": "At Alstom, we understand transport networks and what moves people. From high-speed trains, metros, monorails, and trams, to turnkey systems, services, infrastructure, signalling and digital mobility, we offer our diverse customers the broadest portfolio in the industry. Every day, more than 80000 colleagues lead the way to greener and smarter mobility worldwide, connecting cities as we reduce carbon and replace cars.\nPURPOSE OF THE JOB As part of the ISC (Industrial Services Center) Methods & Process department, you are in charge of CBoM activities related to both process / tools deployment as well as supporting the project on run CBoM on a monthly basis for new mobilisarion.The role is located in Bangalore. ISC is in charge of supporting the Services Regions by providing services activities for maintenance and ALM tenders and projects. ORGANISATION Organisation structure (job belongs to...) - APAC/Services/ Services Engineering Center (SEC) Reports directly to - Services India organization ISC - Methods & Process - Leader Other reporting to: - Services Operations Product Line / CBoM leader Direct reports - N/A Network & Links Position title of connected positions / functional report - Internal SER Ops PL, Projects from every regions WW , BPO, rBPE & IST MAIN RESPONSABILITIES CBoM Set-up phase - Overall presentation including purpose & roles / responsibilities - As-is / to-be gap analysis & lead action tracker - Support with data preparation - Coordinate input data with all stakeholders CBoM Implementation phase - Run CBoM calculation - Perform quality checks, - Analyze the results to provide first recommandations - Liaise with project & follow action plan - Support Change Management activities when required - Identify improvement on processes and tools to better integrate the end to end Customer relation - Ensure strong stakeholder management with Services development, project engineering, tenders, operations, rBPE / BPO etc to ensure good visibility on teams execution and adapt as applicable time to time - Provide up to date information to internal and external customers, - Ensure real time project support and forward-facing defects are efficiently managed. KPIs - Deliverables QCD (RFT, Cost and OTIF), Adherence to delivery plan - Quality of delivrables - Recognition from projects & Regions MAIN REQUIRED COMPETENCES Educational Requirements Mandatory:\nBachelors degree in mechanical Engineering or equivalent. Experience Mandatory:\nBachelors degree in mechanical / industrial engineering\nImplementation of ERP system\nStrong focus on Master data & End-to-end processes, Desirable\nALM and Maintenance activities\nExperience of working in a Service depot or Production environment.\nIntegrated service readiness",
    "Job Title": "ISC -C-BOM data analyst",
    "Location": "Bengaluru",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-05T04:14:23.801Z",
    "Search Experience": "1",
    "Search Location": "Bangalore",
    "Search Query": "Data Analyst",
    "Skills": "master data, erp, gap analysis, change management, stakeholder management, head hunting, leadership hiring, screening, data analysis, alm, hiring, salary negotiation, job portals, hrsd, linkedin, sourcing, staffing, talent acquisition, it recruitment, recruitment",
    "firstScraped": "2025-05-05T04:21:11.999Z",
    "lastUpdated": "2025-05-05T04:21:11.999Z"
  },
  {
    "_id": "68183cb8f8e721138d29a48a",
    "Job URL": "https://www.naukri.com/job-listings-client-data-analyst-jpmorgan-chase-bengaluru-5-to-7-years-260425500268",
    "Application Type": "Internal",
    "Company Name": "JPMorgan Chase Bank",
    "Experience Required": "5-7 Yrs",
    "Job Description": "As a Client Data Analyst in the Client Account Services team, you will manage and support Account Setup, Maintenance, Closures, Static Data Maintenance and Entitlements activities for our clients and regional service teams located in APAC, EMEA and WHEM\nYour role will be pivotal in ensuring all requests related to these activities are completed in a timely fashion\nYou will have the opportunity to engage with global counterparts to re-engineer the service delivery as per Client requirements and participate in various department and team projects to exceed Client expectations\nThis role will provide you with the opportunity to make recommendations on process improvements and provide guidance on more complex operating procedures\nJob Responsibilities\nEnsure timely completion of all requests related to Account Set Up, Maintenance, Closures, Static Data Maintenance, and Entitlements activities for clients and regional service teams in APAC, EMEA, and WHEM.\nPublish MIS/Performance scorecards to senior management on a daily, weekly, and/or monthly basis as required.\nAnalyze trends and engage product service groups in grassroots discussions to address and mitigate issues at a basic level.\nParticipate in various department and team projects to exceed client expectations.\nCollaborate with global counterparts to re-engineer service delivery according to client requirements.\nPerform duties and tasks that are mostly non-routine, requiring experience and judgment within broadly defined practices and policies.\nMake recommendations on process improvements and provide guidance on more complex operating procedures.\nSet up team meetings to review and address client concerns and opportunities as needed.\nAnalyze and prepare reports and scorecards for management.\nFunction as a key contributor with demonstrated knowledge of the area of specialization in an individual contributor role.\nWork closely with the Process Manager and team members to ensure flawless service delivery to franchise clients.\nRequired qualifications, capabilities and skills\nGraduates or MBAs with 5 years of experience.\nStrong verbal and written communication skills.\nMust be extremely client-focused and result-oriented in approach.\nGood team player and self-motivated.\nProficiency in Microsoft Office suite of applications.\nAbility to handle unexpected situations adeptly.\nWillingness to work in any shift.",
    "Job Title": "Client Data Analyst",
    "Location": "Bengaluru",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-05T04:14:14.927Z",
    "Search Experience": "1",
    "Search Location": "Bangalore",
    "Search Query": "Data Analyst",
    "Skills": "Service delivery, Senior management, Product service, static data, MIS, Focus, Data Analyst, Management, MS Office, Individual Contributor",
    "firstScraped": "2025-05-05T04:21:11.998Z",
    "lastUpdated": "2025-05-05T04:21:11.998Z"
  },
  {
    "_id": "68183cb8f8e721138d29a489",
    "Job URL": "https://www.naukri.com/job-listings-data-analyst-international-schools-partnership-bengaluru-10-to-12-years-280425504526",
    "Application Type": "Internal",
    "Company Name": "International Schools Partnership",
    "Experience Required": "10-12 Yrs",
    "Job Description": "We are seeking a versatile Data Analyst who can bridge the gap between the technical and business requirements to drive informed decision-making within ISP. A key focus of the role is to source and help industrialise the extraction of data for the data platform. The ability to clean and query raw data to build requirements for ETL processing ensure accuracy, consistency & governance is key. This role will sit within a project team including Data Engineers, BI Developers, BI Managers and a Scrum Master, and reporting to the Head of Data Engineering.\nWithin this role you will showcase your expertise in QA testing, business analysis and stakeholder management to provide data-driven solutions, combining a unique blend of technical expertise and business strategy with a degree of accuracy.\nBegin with our children and students. Our children and students are at the heart of what we do. Simply, their success is our success. Wellbeing and safety are both essential for learners and learning. Therefore, we are consistent in identifying potential safeguarding and Health & Safety issues and acting and following up on all concerns appropriately.\nTreat everyone with care and respect. We look after one another, embrace similarities and differences and promote the well-being of self and others.\nOperate effectively. We focus relentlessly on the things that are most important and will make the most difference. We apply school policies and procedures and embody the shared ideas of our community.\nAre financially responsible. We make financial choices carefully based on the needs of the children, students and our schools. Learn continuously. Getting better is what drives us. We positively engage with personal and professional development and school improvement. ISP Data Analyst Key\n\nResponsibilities\n\nThe Data Analyst will play a key role in the following tasks, but these roles and responsibilities may change over the data journey, providing an opportunity to grow and shape the role\nSource, clean and query data to build requirements and reports Apply analytical techniques to uncover insights ensuring accuracy and consistency Working closely with business stakeholders to understand the requirements Identify, troubleshoot and track defects to support the development and testing lifecycle Support the wider data team by preparing comprehensive reports and actionable recommendations Ensure high levels of data security and compliance while adhering to data policies and procedures\n\nSkills, Qualifications and Experience\n\nKeen eye for detail Experience with Azure Databricks is essential Strong experience with SQL and Python Experience or knowledge of visualization tools Power BI Experience supporting the development and testing lifecycle Azure DevOps Bachelor s degree in computer science or related field Desirable Effective communication and interpersonal skills, with experience on stakeholder management Ability to manage the evolving data requirement ISP Commitment to Safeguarding Principles\nISP is committed to safeguarding and promoting the welfare of children and young people and expects all staff and volunteers to share this commitment.\nAll post holders are subject to appropriate vetting procedures, including an online due diligence search, references and satisfactory Criminal Background Checks or equivalent covering the previous 10 years employment history.",
    "Job Title": "Data Analyst",
    "Location": "Bengaluru",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-05T04:14:06.622Z",
    "Search Experience": "1",
    "Search Location": "Bangalore",
    "Search Query": "Data Analyst",
    "Skills": "Computer science, Due diligence, Business analysis, data security, Analytical, Data Analyst, Business strategy, Stakeholder management, SQL, Testing",
    "firstScraped": "2025-05-05T04:21:11.998Z",
    "lastUpdated": "2025-05-05T04:21:11.998Z"
  },
  {
    "_id": "68183cb8f8e721138d29a488",
    "Job URL": "https://www.naukri.com/job-listings-data-analyst-vervenest-technologies-private-limited-bengaluru-4-to-8-years-280425903673",
    "Application Type": "Internal",
    "Company Name": "Vervenest Technologies",
    "Experience Required": "4-8 Yrs",
    "Job Description": "Job Description:\nGood communication skills Oral and Written\nStrong customer development functional understanding\nAdvanced Excel skills\nUse of Analysis for Excel (AFO)\nPower BI, Dashboards, Power Queries\nData cleansing & Data validation\nShifts: General Shift (Willing to work in shifts, if required)",
    "Job Title": "Data Analyst",
    "Location": "Bengaluru",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-05T04:13:58.696Z",
    "Search Experience": "1",
    "Search Location": "Bangalore",
    "Search Query": "Data Analyst",
    "Skills": "Data Analysis, Data validation, Power BI, Data cleansing, Power Queries, Data, Analysis, Query",
    "firstScraped": "2025-05-05T04:21:11.998Z",
    "lastUpdated": "2025-05-05T04:21:11.998Z"
  },
  {
    "_id": "68183cb8f8e721138d29a487",
    "Job URL": "https://www.naukri.com/job-listings-data-analyst-contract-position-pivotree-solutions-india-mysuru-bengaluru-mumbai-all-areas-2-to-7-years-290425013317",
    "Application Type": "Internal",
    "Company Name": "Pivotree Solutions India",
    "Experience Required": "2-7 Yrs",
    "Job Description": "Outline of Job\nThe job involves supporting the data and insights needs of Merchandizers and Marketers in\nRetailers, Consumer Brands and Marketplaces.\nTypical projects involve secondary research on internet, managing large data sets, studying data\npatters, manipulating and normalizing information, designing meta data structures, deriving insights\nand managing product information cycle\n\nKey Result Areas\nClient\nUpdate internal reporting Manager on TAT of assigned project deliverables\nUpdate client on project deliverables and schedules when asked by immediate Senior\n\nInternal Team\nAssess customer information requirements and deliver as per customer project SLAs\nWork with the assigned team in planning, scheduling, and execution of day-to-day activities\nand procedures\nPrioritize project tasks and seek assistance from immediate senior as applicable\nEscalate issues noticed in processes and projects to immediate senior in a timely manner\nTest and implement Solutions\nWork with clients to understand their business problems and help articulate the problem\nWork with onsite and offshore team to structure solutions for the identified customer\nproblems\nPeople\nHelp / buddy team members as requested by Supervisor\nUpon request from Supervisor, train new entrants\nUpon request, assist Supervisor in handling teams and ensure project delivery through\nteams\n\nCode of Conduct\nMaintain discipline and professional work ethic to protect the companys image and reputation.\nDo not indulge in unlawful practices and always maintain data confidentiality and integrity Safeguard\nthe company's intellectual property\nEnsure respect and tolerance with regards to cultural differences. Practice inclusiveness and treat\neveryone with respect and dignity\n\nSkills & Qualifications:\nEducation: B.Sc, B.Com, BBA, BMS, or Engineering Diploma\nExperience: 13 years in data analytics, reporting, or research roles\nTechnical Skills: MS Office (Excel proficiency), Internet Research\nDomain Knowledge: E-commerce or retail (preferred)\nSoft Skills: Analytical thinking, time management, communication, problem-solving\nMindset: Self-motivated, detail-oriented, quick learner, and collaborativeSkills & Qualifications:\nEducation: B.Sc, B.Com, BBA, BMS, or Engineering Diploma\nExperience: 13 years in data analytics, reporting, or research roles\nTechnical Skills: MS Office (Excel proficiency), Internet Research\nDomain Knowledge: E-commerce or retail (preferred)\nSoft Skills: Analytical thinking, time management, communication, problem-solving\nMindset: Self-motivated, detail-oriented, quick learner, and collaborative",
    "Job Title": "Data Analyst (Contract Position)",
    "Location": "Mysuru, Bengaluru, Mumbai (All Areas)",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-05T04:13:22.469Z",
    "Search Experience": "1",
    "Search Location": "Bangalore",
    "Search Query": "Data Analyst",
    "Skills": "Data Enrichment, Taxonomy, Data Classification, Data Visualization, Data Analyst, Data Cleansing, Data analysis, Cleansing",
    "firstScraped": "2025-05-05T04:21:11.998Z",
    "lastUpdated": "2025-05-05T04:21:11.998Z"
  },
  {
    "_id": "68183cb8f8e721138d29a486",
    "Job URL": "https://www.naukri.com/job-listings-data-analyst-tata-digital-bengaluru-5-to-7-years-220425502361",
    "Application Type": "Internal",
    "Company Name": "Tata Digital",
    "Experience Required": "5-7 Yrs",
    "Job Description": "Internal Job Description Company: Tata Digital Private Limited About Us Tata Digital is a future-ready company that focuses on creating consumer-centric, high-engagement digital products. By creating a holistic presence across various touchpoints, we aim to be the trusted partner of every consumer and delight them by powering a rewarding life. The companys debut offering, Tata Neu is a superapp that provides an integrated rewards experience across various consumer categories like groceries, fashion and electronics, travel and hospitality, health and fitness, entertainment, and financial services on a single platform. Founded in March 2019, Tata Digital Private Limited is a wholly-owned subsidiary of Tata Sons Private Limited. Basic Information Role Title: Senior Data Analyst Required Technical Skill-set : SQL, Python, PySpark, Azure, Excel, PowerBi (preferred) Vertical: Data Analytics Work Location: Gurugram Work Experience: 5-7 years About the Team and Role: The Analytics team collaborates closely with a diverse range of stakeholders, including Category, Marketing, Product, Technology, FS Payments, Customer Experience, and Customer Service teams. Our mission is to provide actionable insights through data trends and in-depth analysis, helping the business solve complex challenges and drive data-informed decision-making. We are currently seeking a highly skilled Data Analyst with 4-7 years of experience. The ideal candidate will specialize in data analytics, advanced SQL skills, and leveraging data to inform business strategy and decisionmaking. This role requires expertise in data manipulation, modeling, and visualization, with a focus on delivering impactful insights that support various business functions and objectives. Key Responsibilities: Business Insights Analysis: Analyse customer, portfolio, and transactional data to uncover trends, patterns, and actionable insights that support strategic initiatives for the business. Market Competitive Analysis: Perform benchmarking studies to understand market trends and competitive positioning for credit card offerings. Customer Segmentation: Develop frameworks to segment customers based on demographics, behaviour, and usage patterns to drive personalized campaigns and offers. Business Case Development: Enable/Present business cases and feasibility studies for new initiatives, campaigns, and product launches, supported by robust data-driven analysis. Requirement Gathering: Collaborate with business stakeholders to elicit, document, and prioritize requirements for process improvements, product enhancements, and operational strategies. Performance Monitoring: Track and analyze key performance indicators (KPIs) for customer acquisition, retention, spend, and credit risk. Provide recommendations to optimize business outcomes. Process Improvement: Identify gaps in current workflows or operations and suggest process automation or optimization opportunities. Data Modelling: Develop and optimize data models to support reporting, analytics, and business intelligence solutions. Reporting Visualization: Create and maintain interactive dashboards and visualizations using tools like Power BI, Tableau, or Excel to present data insights effectively to stakeholders. Cross-functional Collaboration: Act as a liaison between data, marketing, product, and operations teams to align analytics outputs with business goals. Internal Competencies for the role Education: B.Tech or BE or MCA Experience: Prior experience in Product Analytics/Marketing Analytics/Growth Analytics/Consumer analytics domain, preferably in Credit Card or Financial Services Industry. Business Acumen: Has the ability to define success metrics for different initiatives or campaigns, drive ROI analysis provide recommendations. Analytical Skills: o Advanced analytical and problem-solving skills, with experience in querying large datasets and deriving insights. o Basic knowledge of different regression models clustering techniques. o Identify, analyze, and interpret trends and actionable insights in complex data sets. o Develop and refine customer segmentation models using behavioral, demographic, and transactional data. Technical Expertise: Strong proficiency in SQL, data modeling, and working with large-scale relational databases. Proficiency in Python, PySpark Power BI will be preferred. Communication Collaboration: Ability to work closely with business stakeholders and cross-functional teams to deliver high-impact data solutions. Want to know more about ushttps: / / www.tata.com / business / tata-digital / tata-neu https: / / www.tata.com / newsroom / business / tata-neu https: / / www.linkedin.com / company / tata-digital / about / https: / / www.youtube.com / watchv=xw-l5jBWWpI",
    "Job Title": "Data Analyst",
    "Location": "Bengaluru",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-05T04:12:45.958Z",
    "Search Experience": "1",
    "Search Location": "Bangalore",
    "Search Query": "Data Analyst",
    "Skills": "Process automation, Hospitality, Data modeling, Process improvement, Customer service, Business strategy, Business intelligence, Financial services, SQL, Python",
    "firstScraped": "2025-05-05T04:21:11.998Z",
    "lastUpdated": "2025-05-05T04:21:11.998Z"
  },
  {
    "_id": "68183cb8f8e721138d29a485",
    "Job URL": "https://www.naukri.com/job-listings-python-developer-data-analyst-year-of-under-graduation-before-2022-codesphere-solutions-bengaluru-0-to-5-years-070425005876",
    "Application Type": "Internal",
    "Company Name": "Codesphere Solutions",
    "Experience Required": "0-5 Yrs",
    "Job Description": "HUGE HIRING!\nPython Developer(200 openings)\n1+yrs Experienced candidates\nUG Graduation Year:BEFORE 2022\n*TO APPLY FOR THIS POSITION FILL THIS FORM*: https://forms.gle/Gxq3PV4KDjEhM3EJ8\nMessage us on WhatsApp:9611257332 , No calls, only whatsapp",
    "Job Title": "Python Developer, Data Analyst, - Year of Under Graduation Before 2022",
    "Location": "Hybrid - Bengaluru",
    "Salary": "8-18 Lacs PA",
    "Scraped Date": "2025-05-05T04:12:27.493Z",
    "Search Experience": "1",
    "Search Location": "Bangalore",
    "Search Query": "Data Analyst",
    "Skills": "Python, Pyspark, Data Engineering, Python Framework, Pandas, Tableau, Python Development, Data Analytics, Django Web Framework, SQL",
    "firstScraped": "2025-05-05T04:21:11.998Z",
    "lastUpdated": "2025-05-05T04:21:11.998Z"
  },
  {
    "_id": "68183cb8f8e721138d29a484",
    "Job URL": "https://www.naukri.com/job-listings-data-analyst-diverse-lynx-bengaluru-1-to-5-years-100523502936",
    "Application Type": "Internal",
    "Company Name": "Diverse Lynx",
    "Experience Required": "1-5 Yrs",
    "Job Description": "Managing master data, including creation, updates, and deletion.\nManaging users and user roles.\nProvide quality assurance of imported data, working with quality assurance analysts if necessary.\nCommissioning and decommissioning of data sets.\nProcessing confidential data and information according to guidelines.\nHelping develop reports and analysis.\nManaging and designing the reporting environment, including data sources, security, and metadata.\nSupporting the data warehouse in identifying and revising reporting requirements.\nSupporting initiatives for data integrity and normalization.\nAssessing tests and implementing new or upgraded software and assisting with strategic decisions on new systems.\nGenerating reports from single or multiple systems.\nTroubleshooting the reporting database environment and reports.\nEvaluating changes and updates to source production systems.\nTraining end-users on new reports and dashboards.\nProviding technical expertise in data storage structures, data mining, and data cleansing.",
    "Job Title": "Data Analyst",
    "Location": "Bengaluru",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-05T04:12:19.595Z",
    "Search Experience": "1",
    "Search Location": "Bangalore",
    "Search Query": "Data Analyst",
    "Skills": "Data analysis, Statistical analysis, SAS, Data Analyst, Data analytics, Regression analysis, Data mining, Python, professional",
    "firstScraped": "2025-05-05T04:21:11.998Z",
    "lastUpdated": "2025-05-05T04:21:11.998Z"
  },
  {
    "_id": "68183cb8f8e721138d29a483",
    "Job URL": "https://www.naukri.com/job-listings-data-analyst-iot-log9-materials-bengaluru-0-to-6-years-110325506630",
    "Application Type": "Internal",
    "Company Name": "Log9 Materials",
    "Experience Required": "0-6 Yrs",
    "Job Description": ">\nOperations\nData Analyst (IoT)\nBengaluru\nWork Type: Full Time\nApply Now\nAbout Us\n\nLog9 Materials is on a mission to make global energy 100% clean from cradle to gate. With its core competence in Graphene nanotechnology, Log9 strives to develop advanced energy storage technologies from electrode materials, cell level to pack level.\n\nThe Rapid Charging Battery technology developed by Log9 solves the challenges in adoption for the 2W and 3W electric vehicle platforms while the Aluminum Fuel Cell technology is targeted towards the electrification of long haul, heavier vehicles.\n\nResponsibilities\n\nAnalyzes complex business problems using data from internal and external sources.\nProvides actionable insight to decision-makers to influence strategy and performance.\nIdentifies and interprets trends and patterns in datasets to attribute key business drivers.\nAnalyzes and defines metrics that tie back to business performance and initiatives.\nWill be a proponent of test/learn culture by enabling and supporting experimentation.\nGenerates forecasts, recommendations, and strategic/tactical plans to drive actions.\nCreates specifications and generates reports and analysis mapping to business needs.\nMay provide consultation and lead cross-functional teams to address business issues.\nDirectly produces datasets and reports for analysis using databases and reporting tools.\n\nQualifications\n\nMaster s or Bachelors degree in a relevant field of study.\n4+ years top tier analyst or consulting experience in business intelligence or analytics.\nExperience with customer service or customer operations analytics a huge plus.\nHands-on experience with one or more language(s) used for querying (e.g. SQL, SAS).\nExperience with Big Data/Analytics Power BI / R / Python .\nAdvanced Excel skills including pivot tables, macros, charts, functions, vba modeling\nExperience with Tableau or similar BI platform to develop reports and dashboards\nAbility to tailor insights to present clearly to technical and non-technical audiences\nExperience with delivering analytics recommendations to senior leadership and executive level audiences.\nHands-on to get things done fast and ability to work without continual guidance.\nEnquiring mind with ability to recognize inefficiencies and challenge the status quo.\nAttention to detail combined with creative thinking.\nExcellent written and verbal communication skills.\nSuperior reporting and editing skills.\nWhy should you consider Log9\n\nUnlimited Leaves round the year - No questions asked. We call it the TRUST Policy.\nNO PROBATION PERIOD - You are a confirmed employee from DAY 1\nHealth Policy that covers You, Your Spouse, Kids and your Parents as well.\nA work culture that offers not just professional growth but personal growth as well. You will be eligible for an additional Education allowance.\nHave direct access to our Chief Entertainment Officers in the campus (Buzo, Rosie & Rapid) - They have an open door policy, provided you give them unlimited belly rubs\nSomething you should explore:https: / / www.linkedin.com / company / log9materials /\nLog9 Slice Of Life: https: / / www.youtube.com / watch?v=d53pmPMvIuU\nLog9 Bangalore Head Office: https: / / www.youtube.com / watch?v=0sAon1JE5VA\nLiquid error: undefined method `public_fields for nil:NilClass",
    "Job Title": "Data Analyst (IoT)",
    "Location": "Bengaluru",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-05T04:12:09.291Z",
    "Search Experience": "1",
    "Search Location": "Bangalore",
    "Search Query": "Data Analyst",
    "Skills": "SAS, big data analytics, Data Analyst, Customer service, Business intelligence, Macros, Analytics, Reporting tools, SQL, Python",
    "firstScraped": "2025-05-05T04:21:11.998Z",
    "lastUpdated": "2025-05-05T04:21:11.998Z"
  },
  {
    "_id": "68183cb8f8e721138d29a482",
    "Job URL": "https://www.naukri.com/job-listings-data-analyst-boss-wallah-bengaluru-1-to-3-years-280425500569",
    "Application Type": "Internal",
    "Company Name": "Boss Wallah",
    "Experience Required": "1-3 Yrs",
    "Job Description": "Location: Bengaluru (In-office) Experience: 4+ Years\nAbout Us\n\nBoss Wallah is a platform empowering small business owners and aspiring entrepreneurs with the skills, support, and expert guidance needed to start and grow their businesses. We offer courses from successful entrepreneurs across 100+ business areas, access to 2,000+ experts, and content in six languages (Telugu, Tamil, Kannada, Hindi, Malayalam, and English).\nRole Overview\nWe re looking for a sharp and driven Data Analyst to turn complex datasets into meaningful business insights. You ll build dashboards, analyze trends, and support data-driven decisions across teams.\nKey Requirements\n4+ years of overall tech experience, with at least 2 years in a data analysis role\nBachelor s degree in Computer Science/Engineering from a top-tier college\nPrior experience in a fast-paced B2C startup is highly preferred\nAdvanced knowledge of SQL and data visualization\n\nTech Skills\nProficiency in Metabase or other visualization tools (e.g., Tableau, Power BI)\nExpertise in writing advanced SQL queries\nStrong data storytelling, analytical thinking, and dashboard building skills\n\nResponsibilities\nAnalyze large datasets to uncover insights and trends\nBuild and maintain dashboards for business stakeholders\nPartner with teams across the org to define metrics and track performance\nOptimize data processes for consistency, accuracy, and speed",
    "Job Title": "Data Analyst",
    "Location": "Bengaluru",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-05T04:12:01.350Z",
    "Search Experience": "1",
    "Search Location": "Bangalore",
    "Search Query": "Data Analyst",
    "Skills": "SQL queries, Data analysis, Malayalam, tableau, B2C, Analytical, power bi, Data Analyst, data visualization",
    "firstScraped": "2025-05-05T04:21:11.998Z",
    "lastUpdated": "2025-05-05T04:21:11.998Z"
  },
  {
    "_id": "681839c7f8e721138d29a478",
    "Job URL": "https://www.naukri.com/job-listings-backend-developer-fleetronix-systems-hyderabad-1-to-3-years-270924502786",
    "Application Type": "Internal",
    "Company Name": "Fleetronix Systems",
    "Experience Required": "1-3 Yrs",
    "Job Description": "Fleetronix Systems is looking for Backend Developer to join our dynamic team and embark on a rewarding career journey\nAnalyzing business requirements and translating them into technical specifications\nDesigning and implementing scalable and efficient backend systems, including databases, APIs, and server-side logic\nWriting clean, maintainable, and efficient code that adheres to industry best practices and standards\nCollaborating with front-end developers, designers, and stakeholders to ensure the smooth delivery of projects\nImplementing security and data protection measures to ensure the confidentiality and integrity of sensitive information\nTesting and debugging applications to ensure they are functioning correctly and fixing any issues that arise\nMonitoring performance and optimizing backend systems to ensure they run efficiently and meet SLAs\nStrong experience with backend development technologies, such as SQL, Node\njs, Python, Ruby on Rails, or JavaKnowledge of database design, web application architecture, and RESTful API developmentStrong problem-solving skills and the ability to think creatively and criticallyExcellent communication and collaboration skills, with the ability to work effectively with technical and non-technical stakeholders",
    "Job Title": "Backend Developer",
    "Location": "Hyderabad",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-05T04:05:43.596Z",
    "Search Experience": "0",
    "Search Location": "Hyderabad",
    "Search Query": "Backend Developer",
    "Skills": "web application architecture, dbms, ajax, jquery, sql, database design, java, git, ruby rails, rails, debugging, technical specifications, html, mysql, api, mongodb, communication skills, architecture, rest, python, backend development, javascript, ruby, node.js, aws",
    "firstScraped": "2025-05-05T04:08:38.964Z",
    "lastUpdated": "2025-05-05T04:08:38.964Z"
  },
  {
    "_id": "681839c7f8e721138d29a477",
    "Job URL": "https://www.naukri.com/job-listings-backend-developer-automate-infinities-pvt-ltd-hyderabad-1-to-3-years-041124501704",
    "Application Type": "Internal",
    "Company Name": "Automate Infinities",
    "Experience Required": "1-3 Yrs",
    "Job Description": "Automate Infinities PVT Ltd is looking for Backend Developer to join our dynamic team and embark on a rewarding career journey.\nAnalyzing business requirements and translating them into technical specifications\nDesigning and implementing scalable and efficient backend systems, including databases, APIs, and server-side logicWriting clean, maintainable, and efficient code that adheres to industry best practices and standards\nCollaborating with front-end developers, designers, and stakeholders to ensure the smooth delivery of projectsI\nmplementing security and data protection measures to ensure the confidentiality and integrity of sensitive informationTesting and debugging applications to ensure they are functioning correctly and fixing any issues that arise\nMonitoring performance and optimizing backend systems to ensure they run efficiently and meet SLAs\nStrong experience with backend development technologies, such as SQL, Node\njs, Python, Ruby on Rails, or JavaKnowledge of database design, web application architecture, and RESTful API developmentStrong problem-solving skills and the ability to think creatively and critically\nExcellent communication and collaboration skills, with the ability to work effectively with technical and non-technical stakeholders",
    "Job Title": "Backend Developer",
    "Location": "Hyderabad",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-05T04:05:35.701Z",
    "Search Experience": "0",
    "Search Location": "Hyderabad",
    "Search Query": "Backend Developer",
    "Skills": "web application architecture, dbms, ajax, jquery, sql, database design, java, git, ruby rails, rails, debugging, technical specifications, html, mysql, api, mongodb, communication skills, architecture, rest, python, backend development, javascript, ruby, node.js, aws",
    "firstScraped": "2025-05-05T04:08:38.964Z",
    "lastUpdated": "2025-05-05T04:08:38.964Z"
  },
  {
    "_id": "681839c7f8e721138d29a476",
    "Job URL": "https://www.naukri.com/job-listings-backend-developer-xmachines-hyderabad-1-to-2-years-190624501590",
    "Application Type": "Internal",
    "Company Name": "Xmachines",
    "Experience Required": "1-2 Yrs",
    "Job Description": "XMACHINES is looking for Backend Developer to join our dynamic team and embark on a rewarding career journey\nAnalyzing business requirements and translating them into technical specifications\nDesigning and implementing scalable and efficient backend systems, including databases, APIs, and server-side logic\nWriting clean, maintainable, and efficient code that adheres to industry best practices and standards\nCollaborating with front-end developers, designers, and stakeholders to ensure the smooth delivery of projects\nImplementing security and data protection measures to ensure the confidentiality and integrity of sensitive information\nTesting and debugging applications to ensure they are functioning correctly and fixing any issues that arise\nMonitoring performance and optimizing backend systems to ensure they run efficiently and meet SLAs\nStrong experience with backend development technologies, such as SQL, Node.js, Python, Ruby on Rails, or Java\nKnowledge of database design, web application architecture, and RESTful API development\nStrong problem-solving skills and the ability to think creatively and critically\nExcellent communication and collaboration skills, with the ability to work effectively with technical and non-technical stakeholders",
    "Job Title": "Backend Developer",
    "Location": "Hyderabad",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-05T04:05:27.786Z",
    "Search Experience": "0",
    "Search Location": "Hyderabad",
    "Search Query": "Backend Developer",
    "Skills": "Backend, Coding, Backend Development, Development",
    "firstScraped": "2025-05-05T04:08:38.964Z",
    "lastUpdated": "2025-05-05T04:08:38.964Z"
  },
  {
    "_id": "681839c7f8e721138d29a475",
    "Job URL": "https://www.naukri.com/job-listings-backend-developer-nfosoft-innovations-pvt-ltd-hyderabad-8-to-13-years-270225501798",
    "Application Type": "Internal",
    "Company Name": "Nfosoft Innovations",
    "Experience Required": "8-13 Yrs",
    "Job Description": "nfoSoft Innovations Pvt Ltd is looking for Backend Developer to join our dynamic team and embark on a rewarding career journey\nAnalyzing business requirements and translating them into technical specifications\nDesigning and implementing scalable and efficient backend systems, including databases, APIs, and server-side logic\nWriting clean, maintainable, and efficient code that adheres to industry best practices and standards\nCollaborating with front-end developers, designers, and stakeholders to ensure the smooth delivery of projects\nImplementing security and data protection measures to ensure the confidentiality and integrity of sensitive information\nTesting and debugging applications to ensure they are functioning correctly and fixing any issues that arise\nMonitoring performance and optimizing backend systems to ensure they run efficiently and meet SLAs",
    "Job Title": "Backend Developer",
    "Location": "Hyderabad",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-05T04:04:51.826Z",
    "Search Experience": "0",
    "Search Location": "Hyderabad",
    "Search Query": "Backend Developer",
    "Skills": "css, dbms, hibernate, jquery, sql, microservices, spring, react.js, java, git, debugging, json, technical specifications, html, mysql, data structures, api, mongodb, rest, python, software development, backend development, javascript, spring boot, node.js",
    "firstScraped": "2025-05-05T04:08:38.964Z",
    "lastUpdated": "2025-05-05T04:08:38.964Z"
  },
  {
    "_id": "681839c7f8e721138d29a474",
    "Job URL": "https://www.naukri.com/job-listings-backend-developer-letsmobility-hyderabad-1-to-2-years-290723501942",
    "Application Type": "Internal",
    "Company Name": "Letsmobility Software Solutions",
    "Experience Required": "1-2 Yrs",
    "Job Description": "Building applications and APIs from scratch with Express.js on Node. Responsible for managing the interchange of data between the server and the users. Basic understanding of front-end technologies is necessary as well.\nTechnical Skills Required (Mandatory)\nStrong proficiency with JavaScript (ES6).\nUnderstanding the nature of asynchronous programming.\nExcellent knowledge of Node.js and frameworks available for it such as Express.js/Hapi/Nest.js.\nExperience working with MongoDB,Docker, Redis, MySQL.\nExcellent knowledge of how to Build and Structure a Node.js MVC Application.\nExperience working with Social Authentication, push notifications and SocketI IO for Node.js.\nMust Have:\nEngaged, self-motivated, flexible way of working.\nEnthusiastic to work in an young team.\nStrong communication skills, Fluency in English (written and spoken).\nTechnical Skills Required(Good To Have):\nIdentify and correct bottlenecks and fix bugs.\nUnit-test code for robustness, including edge cases, usability, and general reliability.",
    "Job Title": "Backend Developer",
    "Location": "Hyderabad",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-05T04:04:42.303Z",
    "Search Experience": "0",
    "Search Location": "Hyderabad",
    "Search Query": "Backend Developer",
    "Skills": "Training, Backend, Front end, MySQL, Javascript, Programming, MongoDB, MVC, Unit testing, Management",
    "firstScraped": "2025-05-05T04:08:38.964Z",
    "lastUpdated": "2025-05-05T04:08:38.963Z"
  },
  {
    "_id": "681839c7f8e721138d29a473",
    "Job URL": "https://www.naukri.com/job-listings-backend-developer-with-dsa-bct-consulting-hyderabad-5-to-10-years-090425026859",
    "Application Type": "Internal",
    "Company Name": "Bahwan CyberTek",
    "Experience Required": "5-10 Yrs",
    "Job Description": "We are seeking a Senior Backend Engineer with over 5 years of experience to join our growing engineering team. The ideal candidate has a solid track record of building scalable backend systems and a deep understanding of data structures and algorithms (DSA) to solve complex engineering problems efficiently.\n\nKey Responsibilities:\n\nDesign, develop, and maintain scalable backend systems, APIs, and services.\nOptimize system performance, reliability, and scalability.\nWrite clean, modular, and well-documented code.\nCollaborate closely with frontend developers, product managers, and DevOps.\nApply DSA expertise to design efficient solutions for complex business logic.\nConduct code reviews and mentor junior developers.\nParticipate in architectural discussions and tech roadmap planning.\nRequired Skills:\n\n5+ years of hands-on backend development experience.\nStrong foundation in data structures, algorithms, and system design.\nProficiency in one or more backend languages (e.g., Java, Go, Python, Node.js).\nExperience with RESTful APIs, microservices, and database design (SQL & NoSQL).\nKnowledge of caching, queuing systems, and distributed architecture.\nFamiliarity with cloud platforms (AWS, GCP, or Azure).",
    "Job Title": "Backend Developer With DSA",
    "Location": "Hyderabad",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-05T04:04:23.438Z",
    "Search Experience": "0",
    "Search Location": "Hyderabad",
    "Search Query": "Backend Developer",
    "Skills": "Java, Data Structures And Algorithms, Backend Development, Design Patterns, Data Structures, OOPS, Spring Boot, Object Oriented Programming, Microservices, Python",
    "firstScraped": "2025-05-05T04:08:38.963Z",
    "lastUpdated": "2025-05-05T04:08:38.963Z"
  },
  {
    "_id": "681839c7f8e721138d29a472",
    "Job URL": "https://www.naukri.com/job-listings-backend-developer-fusion-plus-solutions-inc-hyderabad-5-to-8-years-120924501840",
    "Application Type": "Internal",
    "Company Name": "Fusion Plus Solutions",
    "Experience Required": "5-8 Yrs",
    "Job Description": "Total Yrs. of Experience\n* 5 to 8 years plus experience\nRelevant Yrs. of experience\n* 5 to 8 years plus experience\n  Detailed JD\n*(Roles and Responsibilities) Backend developer as experienced in Golang, Postgress Database, NodeJS, ReactJS, Azure/GCP/AWS services with CI/CD tools and pipelines, RESTful API, GraphQL, GRPC, GitHub, Cache and Storage: Redis , Search Engine: Elasticsearch , Containerization: Docker, Kubernetes Mandatory skills\n* React and Node JS experience will be an added advantage.\nDesired skills\n* Golang, Postgress , Good to have experience in Microservices Architecture: Experience with microservices design and deployment\n\",",
    "Job Title": "Backend Developer",
    "Location": "Hyderabad",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-05T04:04:15.289Z",
    "Search Experience": "0",
    "Search Location": "Hyderabad",
    "Search Query": "Backend Developer",
    "Skills": "Backend, github, Architecture, GCP, Javascript, Database, Deployment, AWS, microservices",
    "firstScraped": "2025-05-05T04:08:38.961Z",
    "lastUpdated": "2025-05-05T04:08:38.961Z"
  },
  {
    "_id": "681839c7f8e721138d29a471",
    "Job URL": "https://www.naukri.com/job-listings-backend-developer-way2news-pvt-ltd-hyderabad-3-to-5-years-280421500764",
    "Application Type": "Internal",
    "Company Name": "Way2news",
    "Experience Required": "3-5 Yrs",
    "Job Description": "Strong knowledge of Node.js and Angular\nExperience with MySql Database, MongoDB\nHands-on experience in writing Node.js applications\nKnowledge of Node.js and frameworks like express\nProficiency in front-end technologies, such as HTML5, javascript, and jquery\nExperience and knowledge of open source tools & frameworks, broader cutting-edge technologies around server-side development.\nExperience with IDEs like Visual Studio Code / Sublime text / NetBeans.\nExperience and knowledge of programming languages and databases like JAVA, Web Services, Spring and Redis DB are added bonus.\nOthers :\nBachelors degree in computer science.\nCustomer-focused, react well to changes, work with teams and able to multi-task\nMust be a proven performer and team player that enjoy challenging assignments in a high- energy, fast growing and start-up workplace.",
    "Job Title": "Backend developer",
    "Location": "Hyderabad",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-05T04:04:06.834Z",
    "Search Experience": "0",
    "Search Location": "Hyderabad",
    "Search Query": "Backend Developer",
    "Skills": "Computer science, NetBeans, Backend, jQuery, Front end, Java web services, MySQL, MongoDB, Visual Studio, Open source",
    "firstScraped": "2025-05-05T04:08:38.961Z",
    "lastUpdated": "2025-05-05T04:08:38.961Z"
  },
  {
    "_id": "681839c7f8e721138d29a470",
    "Job URL": "https://www.naukri.com/job-listings-backend-developer-securiti-ai-hyderabad-3-to-8-years-240325505289",
    "Application Type": "Internal",
    "Company Name": "Securiti.ai",
    "Experience Required": "3-8 Yrs",
    "Job Description": "You will be working as a part of a distributed agile team, building a new SaaS platform that underpins a suite of enterprise applications solving a variety of hard data analytics and enterprise problems. You will be responsible for ensuring that the framework and products we develop meet the established design, implementation and quality goals.\n\nResponsibilities\n\nBe a part of a globally distributed team of backend engineers to design/develop/architect Securitis core backend platform\nHelp create architecture documents, functional specifications, design documents and developer test plans\nWrite reliable, secure, performant, and scalable code\nPerform code reviews and analysis\nMonitor platform performance and be on-call to address any urgent issues\nWork with customer support and address customer issues\nIntegrate new technologies into back-end cloud infrastructure\nEvaluate and adapt new technologies where they provide value\n\nRequirements\n\nMinimum 3 years experience developing software, with some experience using container technologies like Docker\nExperience in building highly available and scalable distributed systems for the cloud\nProfessional development experience in GoLang, Python, C++, or Java\nGood knowledge of Linux and Bash scripting\nGood software development practices: should thrive in an environment of rapid development, peer code reviews, and write good functional/unit tests\nExperience with Microservices and REST based HTTP/2 architectures\nExperience with SQL (Postgres) and NoSQL (Mongo/Elasticsearch) technologies\nKnowledge and use of performance tuning, profiling, and software metrics tools\nVery strong diagnostic and troubleshooting skills\nProven ability to utilize creative thinking to solve complex engineering problems\nHigh level of energy, teamwork, can-do attitude and willingness to learn new technologies\nWorking knowledge of networks and web concepts\nStrong attention to detail, curiosity, and a willingness to learn.\n\nBonus Points:\n\nExperience building distributed systems\nExperience with cloud platforms such as AWS, GCP, and Azure\nExperience with Containerization technologies (Kubernetes, Docker)\nExperience with tools like Terraform, Helm\nUnderstanding of Network Services - Load-Balancers, Security, QOS, etc\nUnderstanding of platform level concerns, such as configuration management, network request routing, blue/green or canary deployments, in-service software upgrade etc\nExperience in building API based connectors to cloud-based SaaS services is a big plus\nAbility to work independently",
    "Job Title": "Backend Developer",
    "Location": "Hyderabad",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-05T04:03:58.208Z",
    "Search Experience": "0",
    "Search Location": "Hyderabad",
    "Search Query": "Backend Developer",
    "Skills": "Performance tuning, C++, Automation, Linux, Configuration management, Agile, Troubleshooting, SQL, Python",
    "firstScraped": "2025-05-05T04:08:38.961Z",
    "lastUpdated": "2025-05-05T04:08:38.961Z"
  },
  {
    "_id": "681839c7f8e721138d29a46f",
    "Job URL": "https://www.naukri.com/job-listings-backend-developer-salientminds-technologies-private-limited-hyderabad-1-to-3-years-230523500437",
    "Application Type": "Internal",
    "Company Name": "Salientminds Technologies",
    "Experience Required": "1-3 Yrs",
    "Job Description": "We are seeking a skilled Backend Developer to join our team. The ideal candidate will have experience in developing high-quality, scalable, and secure web applications using the latest backend technologies and best practices.\nResponsibilities:\nDesign, develop, and deploy server-side applications and APIs that power our web and mobile applications\nCollaborate with front-end developers, product managers, and other stakeholders to deliver high-quality software solutions\nDevelop and maintain scalable and performant databases, using tools such as MySQL, PostgreSQL, or MongoDB\nIdentify and address performance bottlenecks, security issues, and other backend-related challenges\nWrite clean and maintainable code, follow coding standards, and contribute to the company s codebase\nStay up-to-date with emerging trends and technologies in backend development and contribute to the team s continuous improvement\nRequirements:\nBachelor s or Master s degree in Computer Science or related field\nProven experience as a Backend Developer or similar role\nStrong proficiency in one or more backend technologies such as Node.js, Python, Ruby, or Java\nExperience with databases such as MySQL, PostgreSQL, or MongoDB\nFamiliarity with DevOps practices and tools such as Docker, Kubernetes, or AWS\nExperience with RESTful APIs and web services\nStrong problem-solving skills, ability to think critically, and attention to detail\nStrong communication skills and ability to work in a team environment",
    "Job Title": "Backend Developer",
    "Location": "Hyderabad",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-05T04:03:49.892Z",
    "Search Experience": "0",
    "Search Location": "Hyderabad",
    "Search Query": "Backend Developer",
    "Skills": "Backend, Front end, Coding, Postgresql, MySQL, MongoDB, Continuous improvement, Ruby, Python",
    "firstScraped": "2025-05-05T04:08:38.961Z",
    "lastUpdated": "2025-05-05T04:08:38.961Z"
  },
  {
    "_id": "681839c7f8e721138d29a46e",
    "Job URL": "https://www.naukri.com/job-listings-backend-developer-thriwe-consulting-new-delhi-hyderabad-2-to-5-years-090425501259",
    "Application Type": "Internal",
    "Company Name": "Thriwe Consulting",
    "Experience Required": "2-5 Yrs",
    "Job Description": "Design, develop, and maintain critical software in a fast-paced quality-conscious\nenvironment\nQuickly understand complex systems/code and own key pieces of the system, including\nthe delivered quality\n\nDiagnose and troubleshoot complex problems in a distributed computing environment\n\nWork alongside other Engineers and cross functional teams to diagnose/troubleshoot\nany production performance related issues\n\nWork in Java, Golang, Python, NodeJS, and React, and built systems on of Docker,\nMySQL, and Redis\n\n\n`\n},\n{\ntitle: Skills,\nhtml: `\n\nExperience in working with Go, NodeJS, or Python\n\nAbility to design, develop, and debug complex code\n\nProper understanding of full stack progressive web applications\n\nProper understanding of networking and security protocols (HTTPS, SSL, Certs)\n\nExperience in building containerized applications (K8S/ Docker) is a plus\n\nExperience in building applications in a Micro Services Architecture is a plus\n\nAbility to design/develop in REST, GRPC, and GraphQL APIs is a plus\n\n\n`\n},\n{\ntitle: What We Offer,\n\"html\": `\n\nMacbook Pro and Monitor for the best development setup\n\nLearning: Upto 5K reimbursement in books, courses\n\nMonthly internet reimbursement\n\nFun Fridays: A fun get together every alternate weekend\n\nLearning: We provide ongoing growth and development courses, and memberships that\nyou may need to be the best at your job\n\nPaid Time Off and Parental Leave\n\nFlexible Working Environment: We have a lot of flexibility in the structure of when we\nwork and how we work together, with flexible hours and a long-standing, supportive\nremote environment\n\nQuarterly outdoor parties\n\nAnnual offsite - out of the city\n\nThriwe membership for one year\n\nFamily health insurance\n\n`\n},\n{\n\"title\": \"About The Company\",\n\"html\": `Thriwe is a technology-driven B2B Consumer Benefits Marketplace catering to both\nNational and International Markets. Founded in the year 2011 with headquarters in India\n(Thriwe Consulting Pvt. Ltd.) and offices across UAE (Thriwe Consulting FZ LLC), Singapore,\nLondon Florida; Thriwe provides an ecosystem that delivers premium customer acquisition,\nretention, and allegiance services to the world s leading financial institutions card networks.\nWe run India s largest tech-enabled Golf management platform and now, have evolved\nourselves to offer a host of lifestyle, wellness, entertainment and shopping benefits. With over\n1,00,000+ partner associations and service delivery presence in 130 countries worldwide, we\nempower clients to invigorate engagement with their most valuable customers.\nAs a software engineer, you will help to build awesome benefit/loyalty solutions for our\ncustomers. You ll work alongside smart, successful, and kind people who are passionate about\nstart-ups. Projects m`\n}",
    "Job Title": "Backend Developer",
    "Location": "Hyderabad, New Delhi",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-05T04:03:42.045Z",
    "Search Experience": "0",
    "Search Location": "Hyderabad",
    "Search Query": "Backend Developer",
    "Skills": "Customer acquisition, Health insurance, Backend, Networking, MySQL, Consulting, Wellness, HTML, SSL, Python",
    "firstScraped": "2025-05-05T04:08:38.961Z",
    "lastUpdated": "2025-05-05T04:08:38.961Z"
  },
  {
    "_id": "681839c7f8e721138d29a46d",
    "Job URL": "https://www.naukri.com/job-listings-backend-developer-mocktheta-hyderabad-2-to-3-years-230821501056",
    "Application Type": "Internal",
    "Company Name": "Mocktheta",
    "Experience Required": "2-3 Yrs",
    "Job Description": "Were looking for Backend Developers to work out of our Hyderabad office.\nDuties\nComplete tasks assigned by team lead\nWork as part of a fast-paced team to perform object-oriented application development\nAnalyze functional requirements and troubleshoot application code issues\nWork closely with other developers and quality assurance engineers\nMentor junior level developers\nDeliver high-quality software\nCommunicate technical and non-technical information clearly\nBackend Developer\nJava or NodeJS or Python\nObject Oriented Programming\nData Structures and Algorithms\nSpring / Spring Boot / Flask / Django,\nRDBMS\nKnowledge of TDD and BDD is a plus\nGit, Yarn, VS Code are a plus\nKnowledge of Automation Testing is a plus",
    "Job Title": "Backend Developer",
    "Location": "Hyderabad",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-05T04:03:33.789Z",
    "Search Experience": "0",
    "Search Location": "Hyderabad",
    "Search Query": "Backend Developer",
    "Skills": "Backend, GIT, RDBMS, TDD, Django, Data structures, HTML, Application development, YARN, Python",
    "firstScraped": "2025-05-05T04:08:38.961Z",
    "lastUpdated": "2025-05-05T04:08:38.961Z"
  },
  {
    "_id": "681839c7f8e721138d29a46c",
    "Job URL": "https://www.naukri.com/job-listings-backend-developer-4s-advisory-s-client-hyderabad-1-to-4-years-150425919392",
    "Application Type": "Internal",
    "Company Name": "Leading Client",
    "Experience Required": "1-4 Yrs",
    "Job Description": "We are looking for an awesome Backend Developer to join our team where you will be getting an amazing learning experience and exposure to all the latest technologies.\n\nResponsibilities:\n\nContribute in all phases of the software development lifecycle.\nWrite well-designed, testable, efficient code.\nPrepare and produce releases of software components.\nSupport continuous improvement by investigating alternatives and technologies and presenting these for architectural review.\n\nRequirements:\n\nB.Tech in Computer Science Engineering/ Information Technology with min 1 - 4 years of relevant experience in B2C only.\nShould have a good hold on Data structures and algorithms.\nHands-on experience in designing and developing applications using Java EE platforms.\nObject Oriented analysis and design using common design patterns.\nExcellent knowledge of Relational Databases, SQL, and ORM technologies (JPA2, Hibernate).\nExperience in the Spring Framework.\nExperience in developing web applications using at least one popular web framework (JSF, Wicket, GWT, Spring MVC).\nExperience in writing Unit tests.\nExcellent communication, analytical, problem problem-solving skills with a strong sense of ownership, urgency, and drive.",
    "Job Title": "Backend Developer",
    "Location": "Hyderabad",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-05T04:03:26.062Z",
    "Search Experience": "0",
    "Search Location": "Hyderabad",
    "Search Query": "Backend Developer",
    "Skills": "Java, Hibernate, JPA2, Object Oriented analysis and design, design patterns, Spring, SQL, Backend Development",
    "firstScraped": "2025-05-05T04:08:38.961Z",
    "lastUpdated": "2025-05-05T04:08:38.961Z"
  },
  {
    "_id": "681839c7f8e721138d29a46b",
    "Job URL": "https://www.naukri.com/job-listings-backend-developer-mocktheta-hyderabad-1-to-2-years-180620500695",
    "Application Type": "Internal",
    "Company Name": "Mocktheta",
    "Experience Required": "1-2 Yrs",
    "Job Description": "Duties\nComplete tasks assigned by team lead\nWork as part of a fast-paced team to perform object-oriented application development\nAnalyze functional requirements and troubleshoot application code issues\nWork closely with other developers and quality assurance engineers\nMentor junior level developers\nDeliver high-quality software\nCommunicate technical and non-technical information clearly\nBackend Developer\nJava or NodeJS or Python\nObject Oriented Programming\nData Structures and Algorithms\nSpring / Spring Boot / Flask / Django,\nRDBMS\nKnowledge of TDD and BDD is a plus\nGit, Yarn, VS Code are a plus\nKnowledge of Automation Testing is a plus",
    "Job Title": "Backend Developer",
    "Location": "Hyderabad",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-05T04:02:49.668Z",
    "Search Experience": "0",
    "Search Location": "Hyderabad",
    "Search Query": "Backend Developer",
    "Skills": "Backend, GIT, RDBMS, TDD, Django, Data structures, Application development, YARN, Object oriented programming, Python",
    "firstScraped": "2025-05-05T04:08:38.961Z",
    "lastUpdated": "2025-05-05T04:08:38.961Z"
  },
  {
    "_id": "681839c7f8e721138d29a46a",
    "Job URL": "https://www.naukri.com/job-listings-backend-developer-cyrrup-solution-hyderabad-1-to-6-years-100323502200",
    "Application Type": "Internal",
    "Company Name": "Cyrrup",
    "Experience Required": "1-6 Yrs",
    "Job Description": "Analyzing business requirements and translating them into technical specifications\nDesigning and implementing scalable and efficient backend systems, including databases, APIs, and server-side logic\nWriting clean, maintainable, and efficient code that adheres to industry best practices and standards\nCollaborating with front-end developers, designers, and stakeholders to ensure the smooth delivery of projects\nImplementing security and data protection measures to ensure the confidentiality and integrity of sensitive information\nTesting and debugging applications to ensure they are functioning correctly and fixing any issues that arise\nMonitoring performance and optimizing backend systems to ensure they run efficiently and meet SLAs\nStrong experience with backend development technologies, such as SQL, Nodejs, Python, Ruby on Rails, or Java\nKnowledge of database design, web application architecture, and RESTful API development\nStrong problem-solving skills and the ability to think creatively and critically\nExcellent communication and collaboration skills, with the ability to work effectively with technical and non-technical stakeholders",
    "Job Title": "Backend Developer",
    "Location": "Hyderabad",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-05T04:02:41.413Z",
    "Search Experience": "0",
    "Search Location": "Hyderabad",
    "Search Query": "Backend Developer",
    "Skills": "Training, software architecture, deep learning, Backend, Statistical analysis, Data modeling, Machine learning, Data structures, Statistics, Python",
    "firstScraped": "2025-05-05T04:08:38.961Z",
    "lastUpdated": "2025-05-05T04:08:38.961Z"
  },
  {
    "_id": "6817f796f8e721138d29a3f5",
    "Job URL": "https://www.naukri.com/job-listings-data-verification-analyst-foundation-ai-kolkata-mumbai-new-delhi-hyderabad-pune-chennai-bengaluru-0-to-5-years-101224501433",
    "Application Type": "Internal",
    "Company Name": "Foundation Ai",
    "Experience Required": "0-5 Yrs",
    "Job Description": "Foundation AI is looking for Data Verification Analyst to join our dynamic team and embark on a rewarding career journey.\nManaging master data, including creation, updates, and deletion.\nManaging users and user roles.\nProvide quality assurance of imported data, working with quality assurance analysts if necessary.\nCommissioning and decommissioning of data sets.\nProcessing confidential data and information according to guidelines.\nHelping develop reports and analysis.\nManaging and designing the reporting environment, including data sources, security, and metadata.\nSupporting the data warehouse in identifying and revising reporting requirements.\nSupporting initiatives for data integrity and normalization.\nAssessing tests and implementing new or upgraded software and assisting with strategic decisions on new systems.\nGenerating reports from single or multiple systems.\nTroubleshooting the reporting database environment and reports.\nEvaluating changes and updates to source production systems.\nTraining end-users on new reports and dashboards.\nProviding technical expertise in data storage structures, data mining, and data cleansing.",
    "Job Title": "Data Verification Analyst",
    "Location": "Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T23:19:26.093Z",
    "Search Experience": "1",
    "Search Location": "Bangalore",
    "Search Query": "Data Analyst",
    "Skills": "metadata, python, data analysis, data management, data analytics, data validation, configuration, data mining, data integrity, dashboards, master data management, cleansing, sql, data cleansing, excel, tableau, quality assurance, data visualization, reporting",
    "firstScraped": "2025-05-04T23:26:13.818Z",
    "lastUpdated": "2025-05-04T23:26:13.818Z"
  },
  {
    "_id": "6817f796f8e721138d29a3f4",
    "Job URL": "https://www.naukri.com/job-listings-data-analyst-solventum-bengaluru-1-to-3-years-120325502989",
    "Application Type": "Internal",
    "Company Name": "Solventum",
    "Experience Required": "1-3 Yrs",
    "Job Description": "As a Data Analyst, you will have the opportunity to tap into your curiosity and collaborate with some of the most innovative and diverse people around the world. Here, you will make an impact by:\nFollow a variety of generally defined procedures under general guidance from data management disciplines\nCollects and cleans a variety of cost, asset and project data from multiple sources and consolidates into a data repository\nAnalyzes data and turns it into meaningful information with effective data visualizations\nMaintains data feeds, repository and visualizations\nAnalyzes data trends and develop proactive alerts for trend deviations\nHandles non-routine and difficult inquiries. Adapts differing techniques and methods to develop solutions for a variety of complex issues. Applies analytical skills for analysis and interpretation of trends or data generated by company reporting systems, statistical results, or other information collection systems.\nMost complex problem solving may include the use of extensive experience, individual reasoning, and research which may deviate from standard techniques and practices.\nYour Skills and Expertise\nTo set you up for success in this role from day one, Solventum requires (at a minimum) the following qualifications:\nBachelor s Degree or higher\nMinimum of 3 years of Data Analytics\nAdditional qualifications that could help you succeed even further in this role include:\nSkills include communication, problem solving, generating data models, PowerBI, AWS QuickSight, Apptio Cloudability",
    "Job Title": "Data Analyst",
    "Location": "Bengaluru",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T23:19:17.867Z",
    "Search Experience": "1",
    "Search Location": "Bangalore",
    "Search Query": "Data Analyst",
    "Skills": "Analytical skills, Data management, data science, Compliance, Healthcare, Data Analyst, Data analytics, AWS, Recruitment",
    "firstScraped": "2025-05-04T23:26:13.818Z",
    "lastUpdated": "2025-05-04T23:26:13.818Z"
  },
  {
    "_id": "6817f796f8e721138d29a3f3",
    "Job URL": "https://www.naukri.com/job-listings-data-analyst-mount-talent-consulting-bengaluru-1-to-4-years-240425926962",
    "Application Type": "Internal",
    "Company Name": "Consulting",
    "Experience Required": "1-4 Yrs",
    "Job Description": "Technical Skills:\nStrong proficiency in statistics (concepts & methodologies like hypothesis testing, sampling, etc.) and its application & interpretation\nHands-on data mining and predictive modeling experience (Linear Regression, Clustering  (K-means, DBSCAN, etc.), Classification (Logistic regression, Decision trees/Random Forest/Boosted Trees), \nTimeseries (SARIMAX/Prophet))etc.\nStrong experience in at least one of the prominent cloud providers (Azure, AWS, GCP) and working knowledge of auto ML solutions (Sage Maker, Azure ML etc.)\nAt least one tool in each category\nProgramming language - Python (Must have), (R Or SAS OR PySpark), SQL (Must have)\nData Visualization (Tableau, QlikView, Power BI, Streamlit) ,\nData management (using Alteryx, MS Access, or any RDBMS)\nML Deployment tools (Airflow, MLflow Luigi, Docker etc.)\nBig data technologies ( Hadoop ecosystem, Spark)\nData warehouse solutions (Teradata, Azure SQL DW/Synapse, Redshift, BigQuery etc,)\nVersion Control (Git/Github/Git Lab)\nMS Office (Excel, PowerPoint, Word)\nCoding IDE (VS Code/PyCharm)\nGenAI tools (OpenAI, Google PaLM/BERT, Hugging Face, etc.)\n  Functional Skills:\nExpertise in building analytical solutions and delivering tangible business value for clients (similar to the use cases below)\nPrice optimization, promotion effectiveness, Product assortment optimization and sales force effectiveness, Personalization/Loyalty programs, Labor Optimization\nCLM and revenue enhancement (segmentation, cross-sell/up-sell, next product to buy, offer recommendation, loyalty, LTV maximization and churn prevention)\nCommunicating with confidence and ease:\nYou will be a clear and confident communicator, able to deliver messages in a concise manner with strong and effective written and verbal communication.",
    "Job Title": "Data Analyst",
    "Location": "Hybrid - Bengaluru",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T23:19:10.071Z",
    "Search Experience": "1",
    "Search Location": "Bangalore",
    "Search Query": "Data Analyst",
    "Skills": "Machine learning, Regression, Predicitve modelling, Python, Data analysis, Machine, Data, Modeling",
    "firstScraped": "2025-05-04T23:26:13.818Z",
    "lastUpdated": "2025-05-04T23:26:13.818Z"
  },
  {
    "_id": "6817f796f8e721138d29a3f2",
    "Job URL": "https://www.naukri.com/job-listings-data-analyst-augie-pets-india-pvt-limited-bengaluru-0-to-3-years-290822500368",
    "Application Type": "Internal",
    "Company Name": "Augie",
    "Experience Required": "0-3 Yrs",
    "Job Description": "Duties and Responsibilities\nResponsible for maintaining the data records with no compromise on the quality which will directly or indirectly affect the organization\nTrouble shooting issues with respect to the information, reports and data retrieved from the database.\nResponsible for preparing reports and present it with appropriate graphs, charts on a weekly monthly basis.\nCapable of performing market analysis, profitability and maintaining metrics with standard format\nResponsible for co-ordinating data with other teams with proper understanding of the data requirement presentations\nCapable of converting the data available in the raw format to the structured format which can be used without performing any additional reworks.\nResponsible for collecting data from various sources and organize the same in the proper format that can be understood easily.",
    "Job Title": "Data Analyst",
    "Location": "Bengaluru",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T23:18:33.919Z",
    "Search Experience": "1",
    "Search Location": "Bangalore",
    "Search Query": "Data Analyst",
    "Skills": "Market analysis, Usage, Excel, Data collection, Database, Data Analyst, data visualization, Troubleshooting, Powerpoint",
    "firstScraped": "2025-05-04T23:26:13.818Z",
    "lastUpdated": "2025-05-04T23:26:13.818Z"
  },
  {
    "_id": "6817f796f8e721138d29a3f1",
    "Job URL": "https://www.naukri.com/job-listings-data-analyst-medinno-technologies-bengaluru-1-to-3-years-200125503534",
    "Application Type": "Internal",
    "Company Name": "Medinno Technologies",
    "Experience Required": "1-3 Yrs",
    "Job Description": "Seeking an experienced data analyst with healthcare expertise to enhance mass screening and lab services. The role involves analyzing large datasets to derive insights and improve predictive outcomes. Proficiency in coding and familiarity with AI tools for healthcare data analytics are essential. Drive impactful solutions in healthcare operations with us.",
    "Job Title": "Data Analyst",
    "Location": "Bengaluru",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T23:18:26.134Z",
    "Search Experience": "1",
    "Search Location": "Bangalore",
    "Search Query": "Data Analyst",
    "Skills": "healthcare operations, Coding, Data Analyst, Data analytics, Operations, Healthcare, Data analysis, Analytics",
    "firstScraped": "2025-05-04T23:26:13.818Z",
    "lastUpdated": "2025-05-04T23:26:13.817Z"
  },
  {
    "_id": "6817f796f8e721138d29a3f0",
    "Job URL": "https://www.naukri.com/job-listings-data-analyst-cindrebay-school-of-fashion-interior-design-hyderabad-coimbatore-thodupuzha-thiruvananthapuram-kochi-kolkata-kannur-indore-nagpur-pune-lucknow-kozhikode-bengaluru-1-to-4-years-101221500466",
    "Application Type": "Internal",
    "Company Name": "Cindrebay School Of Fashion & Interior Design",
    "Experience Required": "1-4 Yrs",
    "Job Description": "Overview\nWe are looking to hire experienced & certified Data Analysts to join our data team who will be responsible for converting raw data into information, information into insight and insight into business decisions, paving the way for data-driven decision-making within the organization. Data Analysts will be in charge of managing our master data set, developing reports, and troubleshooting data issues. Ideal candidates will possess an eye for detail, experience, and a deep understanding of the popular data analysis tools and databases.\nRequired skills\nProven working experience as a Data Analyst or Business Data Analyst\nTechnical expertise regarding data models, database design development, data mining and segmentation techniques\nAdept at queries, report writing and presenting findings\nBachelor s Degree from an accredited university or college in Computer Science, Mathematics, Economics, Information Management or Statistics\nJob responsibilities\nInterpret data, analyze results using statistical techniques and provide ongoing reports\nDevelop and implement databases, data collection systems, data analytics and other strategies that optimize statistical efficiency and quality\nAcquire data from primary or secondary data sources and maintain databases/data systems",
    "Job Title": "Data Analyst",
    "Location": "Hyderabad, Coimbatore, Thodupuzha, Thiruvananthapuram, Kochi, Kolkata, Kannur, Indore, Nagpur, Pune, Lucknow, Kozhikode, Bengaluru",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T23:17:49.543Z",
    "Search Experience": "1",
    "Search Location": "Bangalore",
    "Search Query": "Data Analyst",
    "Skills": "Secondary Data, Database Design Development, Business Data Analyst, Data Collection Systems, Data Analysis, Data Mining, Information Management, Data Analytics, Statistics, Report Writing",
    "firstScraped": "2025-05-04T23:26:13.817Z",
    "lastUpdated": "2025-05-04T23:26:13.817Z"
  },
  {
    "_id": "6817f796f8e721138d29a3ef",
    "Job URL": "https://www.naukri.com/job-listings-data-analyst-zamp-bengaluru-1-to-2-years-240325503469",
    "Application Type": "Internal",
    "Company Name": "Zamp",
    "Experience Required": "1-2 Yrs",
    "Job Description": "Key Responsibilities :\nPlay a pivotal role in onboarding customer and extracting data from platforms such as Banks, ERPs, and SaaS tools by standardizing the data.\nBuild automation pipelines to generate and distribute customer reports via Slack and email, significantly reducing manual effort and operational costs.\nImprove visibility for internal customer teams by creating high-accuracy, low-latency reporting systems.\nHelp onboard customers with their unique data schemas and business needs to ensure seamless transitions and standardized solutions.\nDevelop and build internal features that help with engineering workflows..\nQualifications Skill Set Required:\nExpertise in data analytics with 1 - 2 years of experience supporting reconciliation, analysis.\nExperience with Python/R/Pyspark for data analysis and automation.\nStrong knowledge of Excel, Google Sheets, and data visualization tools (Tableau, Power BI, or Looker).\nAbility to analyze complex data sets, draw insights, and present findings effectively.\nDemonstrated ability to organize and interpret large data sets, identify trends, and provide actionable insights.\nEffective written and verbal communication skills for presenting findings to stakeholders. Strong collaborator, adept at presenting data insights to cross-functional teams and executives to guide strategic decision-making.\nFamiliarity with compliance standards and legal processes (preferred, but not necessarily required).\nStrong attention to detail and accuracy in data handling.",
    "Job Title": "Data Analyst",
    "Location": "Bengaluru",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T23:17:41.574Z",
    "Search Experience": "1",
    "Search Location": "Bangalore",
    "Search Query": "Data Analyst",
    "Skills": "Data analysis, Automation, Skill development, Reconciliation, power bi, Data analytics, Medical insurance, data visualization, Operations, Python",
    "firstScraped": "2025-05-04T23:26:13.817Z",
    "lastUpdated": "2025-05-04T23:26:13.817Z"
  },
  {
    "_id": "6817f796f8e721138d29a3ee",
    "Job URL": "https://www.naukri.com/job-listings-data-analyst-sharechat-bengaluru-1-to-3-years-250425502827",
    "Application Type": "Internal",
    "Company Name": "ShareChat",
    "Experience Required": "1-3 Yrs",
    "Job Description": "Querying the Database: Using SQL to run queries on ShareChat s analytical engine built on bigquery\nScripting: Writing scalable scripts to fetch or modify data from API endpoints\nAnalytical Skills: You will work with large amounts of data related to user behaviour on ShareChat\nYou will need to see through the data and analyze it to find conclusions\nCritical Thinking: You may need to look for trend and patterns in data to come up with new conclusions based on the findings\nAttention to Detail: Data is precise\nYou have to make sure you are vigilant in your analysis to come to correct conclusions\nWho are you\nBS in Mathematics, Economics, Computer Science, Information Management or Statistics is preferred\nProven working experience as a data analyst or business data analyst\nTechnical expertise regarding data models, database design development, data mining and segmentation techniques\n Strong knowledge of and experience with reporting packages (Business Objects etc), databases (SQL etc), programming (XML, Javascript, or ETL frameworks)\nKnowledge of statistics and experience using statistical packages for analyzing datasets (Excel, SPSS, SAS etc)\nStrong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracy\nAdept at queries, report writing and presenting findings",
    "Job Title": "Data Analyst",
    "Location": "Bengaluru",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T23:17:33.629Z",
    "Search Experience": "1",
    "Search Location": "Bangalore",
    "Search Query": "Data Analyst",
    "Skills": "Business objects, SAS, Database design, XML, Social media, Javascript, SPSS, Data mining, SQL",
    "firstScraped": "2025-05-04T23:26:13.817Z",
    "lastUpdated": "2025-05-04T23:26:13.817Z"
  },
  {
    "_id": "6817f796f8e721138d29a3ed",
    "Job URL": "https://www.naukri.com/job-listings-data-analyst-awesome-analytics-kolkata-mumbai-new-delhi-hyderabad-pune-chennai-bengaluru-1-to-4-years-290425501607",
    "Application Type": "Internal",
    "Company Name": "Awesome Analytics",
    "Experience Required": "1-4 Yrs",
    "Job Description": "About Us:\nAt Awesome Analytics, we're not just a company; we're a community of data enthusiasts, problem solvers, and innovators\nOur mission is to empower organizations with data-driven insights that transform their decision-making processes\nAs a remote-first data analytics company based in India, we've redefined the way we work to make data analytics accessible and enjoyable for our team members\nOur Mission\nAutomate your work, elevate your life\nOur Culture:\nWe embrace a culture of collaboration, flexibility, and continuous learning\nAt Awesome Analytics, you'll find a diverse group of professionals who thrive on challenges and believe in the transformative power of data\nWe encourage creativity and provide the autonomy to explore new ideas and technologies\nOur remote-first approach allows you to work from anywhere in India, providing you with the freedom to balance work and life seamlessly\nWhy Work with Us:\nCutting-Edge Projects: Join us in working on exciting projects that leverage the latest data analytics tools and technologies\nYou'll have the opportunity to make a real impact and shape the future of data analytics\nProfessional Growth: We invest in our team members' growth and development\nWhether you're a seasoned data analyst or just starting your career, you'll have access to mentorship, training, and a clear path for advancement\nWork-Life Harmony: We believe in the importance of work-life balance\nAs a remote-first company, you'll have the flexibility to design your workday to suit your needs and achieve your best performance\nInclusive Environment: Diversity and inclusion are at the heart of our company\nWe value different perspectives and backgrounds, and we're committed to creating an inclusive environment where everyone's voice is heard\nImpactful Work: Our projects often have a direct impact on our clients' success\nYou'll see the results of your hard work and expertise as you help organizations make data-driven decisions that drive growth and innovation\nJoin Our Team:\nIf you're passionate about data analytics, enjoy working remotely, and want to be part of a dynamic and inclusive team, Awesome Analytics is the place for you\nCome join us in shaping the future of data analytics and making an impact from wherever you are in India\nBrief Responsibilities:\nUsing Excel, Power Bi and Python to independently develop reports and automation\nDesign data models and develop Dashboards\nAutomating various processes and reports using macros & ETL tools\nStaying up-to-date on the latest IT advancements to automate and modernize systems\nBe the go-to person on a subject/area for internalteams\nParticipate in developing case studies\nTechnical Skills:\nMinimum 2 year's RELEVANT experience in preparing MIS or data analysis for various clients\nThoroughknowledgeof Advanced Excel Formula& Features\nHands-on experience of VBA / Macrosin Excel or entire MS Office\nKnowledge of Power BI\nKnowledge of Python\nPower BI Service / Power BIGateway / Power BI Report Server\nExposure to MSBIOR Power PivotDAX functions (Power BI)\nSoft Skills\nStrong analytical and problem-solving skills\nEffective time management skills\nMust be pro-active\nAbility to establish and maintain effective communication\nFluent in English\nGood to have:\nHands on experience of SQL and SSIS OR Power Query (Advanced)\nNon Excel Automation like UI Path / Power Automate\nAny Dot Netprogramming language like C# will be an added advantage\nQualifications\nBachelor's or Master's degree in Data Analytics/Data Science\n1 2 years' Data Analysis experience\nShow more Show less",
    "Job Title": "Data Analyst",
    "Location": "Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T23:17:25.398Z",
    "Search Experience": "1",
    "Search Location": "Bangalore",
    "Search Query": "Data Analyst",
    "Skills": "excel, macros, data analysis, vba, mis, advanced excel, msbi",
    "firstScraped": "2025-05-04T23:26:13.817Z",
    "lastUpdated": "2025-05-04T23:26:13.817Z"
  },
  {
    "_id": "6817f796f8e721138d29a3ec",
    "Job URL": "https://www.naukri.com/job-listings-data-analyst-l3-wipro-limited-bengaluru-1-to-3-years-090425922238",
    "Application Type": "Internal",
    "Company Name": "Wipro",
    "Experience Required": "1-3 Yrs",
    "Job Description": "Wipro Limited (NYSEWIT, BSE507685, NSEWIPRO) is a leading technology services and consulting company focused on building innovative solutions that address clients most complex digital transformation needs. Leveraging our holistic portfolio of capabilities in consulting, design, engineering, and operations, we help clients realize their boldest ambitions and build future-ready, sustainable businesses. With over 230,000 employees and business partners across 65 countries, we deliver on the promise of helping our customers, colleagues, and communities thrive in an ever-changing world. For additional information, visit us at www.wipro.com.\n\n\n\n\n\n\n\nThe purpose of this role is to interpret data and turn into information (reports, dashboards, interactive visualizations etc) which can offer ways to improve a business, thus affecting business decisions.\n\n\n\n\n\n\n\n1. Managing the technical scope of the project in line with the requirements at all stages\n\na. Gather information from various sources (data warehouses, database, data integration and modelling) and interpret patterns and trends\n\nb. Develop record management process and policies\n\nc. Build and maintain relationships at all levels within the client base and understand their requirements.\n\nd. Providing sales data, proposals, data insights and account reviews to the client base\n\ne. Identify areas to increase efficiency and automation of processes\n\nf. Set up and maintain automated data processes\n\ng. Identify, evaluate and implement external services and tools to support data validation and cleansing.\n\nh. Produce and track key performance indicators\n\n\n\n2. Analyze the data sets and provide adequate information\n\na. Liaise with internal and external clients to fully understand data content\n\nb. Design and carry out surveys and analyze survey data as per the customer requirement\n\nc. Analyze and interpret complex data sets relating to customers business and prepare reports for internal and external audiences using business analytics reporting tools\n\nd. Create data dashboards, graphs and visualization to showcase business performance and also provide sector and competitor benchmarking\n\ne. Mine and analyze large datasets, draw valid inferences and present them successfully to management using a reporting tool\n\nf. Develop predictive models and share insights with the clients as per their requirement\n\n\n\n\n\n\nNoPerformance ParameterMeasure1.Analyses data sets and provide relevant information to the clientNo. Of automation done, On-Time Delivery, CSAT score, Zero customer escalation, data accuracy\n\n\n\n\n\n\nReinvent your world.",
    "Job Title": "Data Analyst L3",
    "Location": "Bengaluru",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T23:16:49.143Z",
    "Search Experience": "1",
    "Search Location": "Bangalore",
    "Search Query": "Data Analyst",
    "Skills": "data analysis, data mining, data warehousing, business analytics, dashboards, python, data analytics, data validation, business analysis, dbms, cleansing, sales, sql, analytics reporting, tableau, reporting tools, data integration, digital transformation",
    "firstScraped": "2025-05-04T23:26:13.817Z",
    "lastUpdated": "2025-05-04T23:26:13.817Z"
  },
  {
    "_id": "6817f796f8e721138d29a3eb",
    "Job URL": "https://www.naukri.com/job-listings-data-analyst-bombay-play-private-limited-bengaluru-0-to-3-years-020224501624",
    "Application Type": "Internal",
    "Company Name": "Bombay Play",
    "Experience Required": "0-3 Yrs",
    "Job Description": "Bombay Play Data Analyst use our expansive data to deliver fundamental insights on who our audience is, how they engage with our games, and what are the best ways to acquire them. We strive for a better understanding of our players which translates into challenges and features that delight them. Here s where you would come in: identify and formalise problems related to player behaviour and user acquisition. Build analyses and systems to derive insights that change the Product team s world view. Be innovative, be creative, use every bit of that key commodity data. Millions of people play Bombay Play games every month, so our data is tremendously rich, and we have a lot of it!\nWe will rely on you to communicate your findings to your peers both technical and non-technical. Your solutions to difficult problems will need to be demonstrably impactful, visual and maintainable. You will work with our engineering teams to put your models into production. You will collaborate with User Acquisition Managers, Product Managers, and Engineers to deliver business impact, changing current practices in line with new findings and insights.\n\n\nKEY ROLES & RESPONSIBILITIES\nAnalyze and acquire a deep understanding of game features/user behaviour/metric trends through data and share actionable and valuable insights with the team to drive product decisions\nUnderstanding business requirements and implementing analytical solutions & techniques\nDesigning and analysing experiments to test new product ideas\nDeveloping algorithms and predictive models to solve critical business problems and test feasibility of solution approach\nPrototyping new ways to visualise and understand data relationships\nOwn the design, development, and maintenance of ongoing reports, dashboards, etc.\nDeveloping tools and libraries that will help the team to improve efficiency\n\n\nYOUR BACKGROUND\nKnowledge of applied mathematics, statistical methods, machine learning and algorithms with a formal degree in Business/Economics/Statistics or Engineering\nHands-on experience with SQL\nExperience working with R or similar open source statistical software\nAnalytical coder adept in any scripting language (Python, C++, JavaScript etc.,)\nExperience in applied statistics, understanding of controlled experiments is an advantage\nDeadline driven, ability to work independently\nDetail oriented, with a strong passion for analytics and problem solving\nExcellent written and oral communication skills\n\n\nWHAT DO WE OFFER\nCompetitive salary, discretionary annual bonus scheme and stock allowance;\nFlexible timing and work from home days;\nLocated in the heart of vibrant Bangalore. Our office is a stones throw from everything you need;\nBeautifully designed large office space;\nWork directly with experienced founders with deep expertise in their fields.",
    "Job Title": "Data Analyst",
    "Location": "Bengaluru",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T23:16:41.047Z",
    "Search Experience": "1",
    "Search Location": "Bangalore",
    "Search Query": "Data Analyst",
    "Skills": "C++, Analytical, Machine learning, Javascript, Data Analyst, Open source, Statistics, Analytics, SQL, Python",
    "firstScraped": "2025-05-04T23:26:13.817Z",
    "lastUpdated": "2025-05-04T23:26:13.817Z"
  },
  {
    "_id": "6817f796f8e721138d29a3ea",
    "Job URL": "https://www.naukri.com/job-listings-data-analyst-l4-wipro-limited-bengaluru-0-to-4-years-160425914363",
    "Application Type": "Internal",
    "Company Name": "Wipro",
    "Experience Required": "0-4 Yrs",
    "Job Description": "Wipro Limited (NYSEWIT, BSE507685, NSEWIPRO) is a leading technology services and consulting company focused on building innovative solutions that address clients most complex digital transformation needs. Leveraging our holistic portfolio of capabilities in consulting, design, engineering, and operations, we help clients realize their boldest ambitions and build future-ready, sustainable businesses. With over 230,000 employees and business partners across 65 countries, we deliver on the promise of helping our customers, colleagues, and communities thrive in an ever-changing world. For additional information, visit us at www.wipro.com.\n About The Role  \n\n\n\nThe purpose of this role is to interpret data and turn into information (reports, dashboards, interactive visualizations etc) which can offer ways to improve a business, thus affecting business decisions.\n\n \n\n\n\n1. Managing the technical scope of the project in line with the requirements at all stages\n\na. Gather information from various sources (data warehouses, database, data integration and modelling) and interpret patterns and trends\n\nb. Develop record management process and policies\n\nc. Build and maintain relationships at all levels within the client base and understand their requirements.\n\nd. Providing sales data, proposals, data insights and account reviews to the client base\n\ne. Identify areas to increase efficiency and automation of processes\n\nf. Set up and maintain automated data processes\n\ng. Identify, evaluate and implement external services and tools to support data validation and cleansing.\n\nh. Produce and track key performance indicators\n\n\n\n2. Analyze the data sets and provide adequate information\n\na. Liaise with internal and external clients to fully understand data content\n\nb. Design and carry out surveys and analyze survey data as per the customer requirement\n\nc. Analyze and interpret complex data sets relating to customer??s business and prepare reports for internal and external audiences using business analytics reporting tools\n\nd. Create data dashboards, graphs and visualization to showcase business performance and also provide sector and competitor benchmarking\n\ne. Mine and analyze large datasets, draw valid inferences and present them successfully to management using a reporting tool\n\nf. Develop predictive models and share insights with the clients as per their requirement\n\n \n\n\nNoPerformance ParameterMeasure1.Analyses data sets and provide relevant information to the clientNo. Of automation done, On-Time Delivery, CSAT score, Zero customer escalation, data accuracy",
    "Job Title": "Data Analyst - L4",
    "Location": "Bengaluru",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T23:16:32.832Z",
    "Search Experience": "1",
    "Search Location": "Bangalore",
    "Search Query": "Data Analyst",
    "Skills": "data analysis, data mining, business analytics, dashboards, sales, python, data validation, data warehousing, pivot table, dbms, vlookup, cleansing, sql, analytics reporting, tableau, vba, advanced excel, reporting tools, data integration, digital transformation",
    "firstScraped": "2025-05-04T23:26:13.817Z",
    "lastUpdated": "2025-05-04T23:26:13.817Z"
  },
  {
    "_id": "6817f796f8e721138d29a3e9",
    "Job URL": "https://www.naukri.com/job-listings-client-data-analyst-jpmorgan-chase-bengaluru-0-to-7-years-180425504143",
    "Application Type": "Internal",
    "Company Name": "JPMorgan Chase Bank",
    "Experience Required": "0-7 Yrs",
    "Job Description": "Take a lead role in acquiring, managing and retaining meaningful relationships that deliver outstanding experience to our customers.\nJob Summary\nAs a Client Data Analyst within our Securities Services sector, you will play a crucial role in managing e-Banking access for our client-facing products. You will work closely with both internal and external stakeholders, including our clients and our Client Service/Solutions, Middle Office, and Help Desk teams. Your role will involve understanding complex client requirements, managing inquiries, and controlling access. We believe in delivering best-in-class solutions, and your clear understanding of our business will be key to this. This role provides an excellent opportunity to engage effectively with clients and stakeholders and contribute to our continuous improvement initiatives.\nJob Responsibilities\nEnsure timeliness and accuracy by completing client instructions and queries in strict adherence to SOPs and SLAs.\nPerform validations on client instructions and seamlessly administer client user access to electronic banking products on provisioning applications in a controlled and risk-free manner.\nBe aware of operational risk scenarios associated with the role and develop ideas to mitigate risk.\nIdentify and resolve concerns by assisting Clients, Client Service, Middle Office, and Help Desk.\nAnticipate escalation-prone scenarios and manage them proactively.\nOwn, promote, and drive continuous improvement initiatives.\nRequired qualifications, capabilities and skills\nLiaise with clients using strong verbal and written communication skills.\nDemonstrate strong analytical skills and a desire to work in a fast-paced environment with multiple deliverables.\nCollaborate effectively as a team player and maintain self-motivation.\nWork under time-sensitive business deadlines with the ability to work independently.\nExhibit proven skills in time management and attention to detail.\nAdapt to work in shifts.\nPreferred Qualifications, Capabilities, and Skills\nDemonstrate proficiency in the Microsoft Office suite of applications.\nPreferably experienced with new-age tools like Alteryx, Tableau, Xceptor, etc.",
    "Job Title": "Client Data Analyst",
    "Location": "Bengaluru",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T23:16:23.910Z",
    "Search Experience": "1",
    "Search Location": "Bangalore",
    "Search Query": "Data Analyst",
    "Skills": "Analytical skills, Operational risk, Helpdesk, Client servicing, Time management, Data Analyst, Management, Continuous improvement, MS Office, banking products",
    "firstScraped": "2025-05-04T23:26:13.817Z",
    "lastUpdated": "2025-05-04T23:26:13.817Z"
  },
  {
    "_id": "6817f796f8e721138d29a3e8",
    "Job URL": "https://www.naukri.com/job-listings-data-analyst-infineon-technologies-pvt-ltd-bengaluru-0-to-2-years-080425502838",
    "Application Type": "Internal",
    "Company Name": "Infineon",
    "Experience Required": "0-2 Yrs",
    "Job Description": "Platform enabler software development and testing for Infineon s Automotive Industrial chipsets\n\nJob Description\nMicrocontroller Device Driver Software development and validation for various peripherals of Infineon s microcontrollers based on ARM cortex M0, M4 (eg Ethernet, USB, UART,CAN, SPI, I2C, LIN, Flash, Timers, PWM, Lighting systems, Human Machine Interface, SDMMC etc)\nApplication/UI development in Eclipse environment",
    "Job Title": "Data Analyst",
    "Location": "Bengaluru",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T23:16:15.754Z",
    "Search Experience": "1",
    "Search Location": "Bangalore",
    "Search Query": "Data Analyst",
    "Skills": "cortex, Semiconductor, USB, Eclipse, Ethernet, Application development, human machine interface, SPI, Automotive, SDLC",
    "firstScraped": "2025-05-04T23:26:13.817Z",
    "lastUpdated": "2025-05-04T23:26:13.817Z"
  },
  {
    "_id": "6817f796f8e721138d29a3e7",
    "Job URL": "https://www.naukri.com/job-listings-data-analyst-digital-glyde-kolkata-mumbai-new-delhi-hyderabad-pune-chennai-bengaluru-0-to-3-years-170524500934",
    "Application Type": "Internal",
    "Company Name": "Digital Glyde",
    "Experience Required": "0-3 Yrs",
    "Job Description": "We re seeking a motivated Data Analyst to join our data-driven team. You ll play a vital role in extracting meaningful insights from our data, helping to shape strategic decisions and inform business actions. Your expertise in Excel and data analysis will be essential as you explore, organize, and present data to drive informed decision-making across the organization.\n\nResponsibilities\nGather, cleanse, and organize data from multiple sources, including databases, spreadsheets, and external systems.\nUtilize your Excel skills to analyze data sets and identify patterns, trends, and anomalies.\nDesign and develop insightful reports, dashboards, and visualizations using Power BI or similar tools.\nCollaborate with cross-functional teams to understand their data needs and deliver actionable recommendations.\nSupport data integration and migration projects, ensuring data integrity and consistency.\nProactively identify opportunities for data-driven improvements and optimization.\nQualifications\nBachelor s degree in a quantitative field (e.g., Statistics, Mathematics, Economics) or relevant experience.\n0-3 years of experience in data analysis or a related field.\nExpert-level proficiency in Microsoft Excel, including advanced functions, pivot tables, and data manipulation techniques.\nFamiliarity with Power BI or other data visualization tools.\nUnderstanding of data integration and migration principles.\nStrong analytical and problem-solving skills.\nExcellent communication and presentation skills, with the ability to translate complex data into actionable insights.\nNice to Have\nExperience with SQL or other query languages.\nKnowledge of statistical analysis techniques.\nFamiliarity with Python or R for data analysis is a plus.",
    "Job Title": "Data Analyst",
    "Location": "Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T23:16:07.440Z",
    "Search Experience": "1",
    "Search Location": "Bangalore",
    "Search Query": "Data Analyst",
    "Skills": "Data analysis, Excel, Statistical analysis, Analytical, power bi, data integrity, Data Analyst, data visualization, SQL, Python",
    "firstScraped": "2025-05-04T23:26:13.817Z",
    "lastUpdated": "2025-05-04T23:26:13.817Z"
  },
  {
    "_id": "6817f46ff8e721138d29a3e5",
    "Job URL": "https://www.naukri.com/job-listings-backend-developer-fusion-plus-solutions-inc-hyderabad-5-to-10-years-100125500866",
    "Application Type": "Internal",
    "Company Name": "Fusion Plus Solutions",
    "Experience Required": "5-10 Yrs",
    "Job Description": "Position Overview:\nAs a Senior Software Engineer specializing in backend technologies for Storage and Network monitoring in an AI enabled Data center as well as Cloud, you will play a critical role in designing, developing, and delivering high-quality features within aggressive timelines. Your expertise in microservices-based streaming architectures and strong hands-on development skills are essential to solve complex problems related to large-scale data processing. Proficiency in backend technologies such as Java, Python is crucial.\nKey Responsibilities:\nHands-on Development: Actively participate in the design, development, and delivery of high-quality features, demonstrating strong hands-on expertise in backend technologies like Java, Python, Go or related languages.\nMicroservices and Streaming Architectures: Design and implement microservices-based streaming architectures to efficiently process and analyze large volumes of data, ensuring real-time insights and optimal performance.\nAgile Development: Collaborate within an agile development environment to deliver features on aggressive schedules, maintaining a high standard of quality in code, design, and architecture.\nFeature Ownership: Take ownership of features from inception to deployment, ensuring they meet product requirements and align with the overall product vision.\nProblem Solving and Optimization: Tackle complex technical challenges related to data processing, storage, and real-time monitoring, and optimize backend systems for high throughput and low latency.\nCode Reviews and Best Practices: Conduct code reviews, provide constructive feedback, and promote best practices to maintain a high-quality and maintainable codebase.\nCollaboration and Communication: Work closely with cross-functional teams, including UI/UX designers, product managers, and QA engineers, to ensure smooth integration and alignment with product goals.\nDocumentation: Create and maintain technical documentation, including system architecture, design decisions, and API documentation, to facilitate knowledge sharing and onboarding.",
    "Job Title": "Backend Developer",
    "Location": "Hyderabad",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T23:07:19.834Z",
    "Search Experience": "0",
    "Search Location": "Hyderabad",
    "Search Query": "Backend Developer",
    "Skills": "spring boot, Backend, microservices, Development, Boot, Spring, Backend Development",
    "firstScraped": "2025-05-04T23:12:47.591Z",
    "lastUpdated": "2025-05-04T23:12:47.591Z"
  },
  {
    "_id": "6817f46ff8e721138d29a3e4",
    "Job URL": "https://www.naukri.com/job-listings-backend-developer-beehyv-software-solutions-pvt-ltd-hyderabad-1-to-6-years-041023501295",
    "Application Type": "Internal",
    "Company Name": "BeeHyv Software Solutions Pvt. Ltd.",
    "Experience Required": "1-6 Yrs",
    "Job Description": "Design, develop, test, deploy, maintain, support, and improve the software products and applications.\nManage individual project priorities, deadlines, and deliverables.\nWork on one or multiple projects and deliver results.\nBe versatile and enthusiastic to tackle new problems across different technologies.\nShould be willing to learn at least one more technology stack in addition to your current skill.\nShould be willing to be a full stack developer and become proficient in both backend and UI technologies.\nRequirements\nB Tech from a top institute.\nAt least 1 year of total experience building enterprise-grade software using Java, Python, or similar technologies.\nSolid knowledge of OOP software concepts, design patterns, and best practices.\nStrong understanding of and implementation experience using Core Java, Spring, REST, Relational databases, SQL, JPA, Hibernate/iBatis or Python, Django, SqlAlchemy, Celery, or equivalent frameworks.\nPassionate about learning new technologies take pride in code quality and a self-starter\nStrong problem solving and analytical skills.\nAbility to work collaboratively within a team environment to meet aggressive goals and high-quality standards.\nAbility to follow standard engineering principles and practices using Agile and Automation.\nExperience administering and deploying development CI/CD tools such as Git, Jira, GitLab, or Jenkins is a plus.\nExperience with open-source technologies and cloud services like AWS, GCP, and Azure is a plus.\nExperience in developing mobile apps is a plus Android, iOS, Ionic/React Native/Flutter\nStrong oral and written communication skills are essential",
    "Job Title": "Backend - Developer",
    "Location": "Hyderabad",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T23:06:43.614Z",
    "Search Experience": "0",
    "Search Location": "Hyderabad",
    "Search Query": "Backend Developer",
    "Skills": "Hibernate, Core Java, Automation, Agile, iBATIS, Open source, JIRA, SQL, Android, Python",
    "firstScraped": "2025-05-04T23:12:47.591Z",
    "lastUpdated": "2025-05-04T23:12:47.591Z"
  },
  {
    "_id": "6817f46ff8e721138d29a3e3",
    "Job URL": "https://www.naukri.com/job-listings-backend-developer-craftnotion-hyderabad-8-to-13-years-270325503800",
    "Application Type": "Internal",
    "Company Name": "Craftnotion",
    "Experience Required": "8-13 Yrs",
    "Job Description": "Craftnotion is looking for Backend Developer to join our dynamic team and embark on a rewarding career journey.\nAnalyzing business requirements and translating them into technical specifications\nDesigning and implementing scalable and efficient backend systems, including databases, APIs, and server-side logic\nWriting clean, maintainable, and efficient code that adheres to industry best practices and standards\nCollaborating with front-end developers, designers, and stakeholders to ensure the smooth delivery of projects\nImplementing security and data protection measures to ensure the confidentiality and integrity of sensitive information\nTesting and debugging applications to ensure they are functioning correctly and fixing any issues that arise\nMonitoring performance and optimizing backend systems to ensure they run efficiently and meet SLAs\nStrong experience with backend development technologies, such as SQL, Node\njs, Python, Ruby on Rails, or JavaKnowledge of database design, web application architecture, and RESTful API development\nStrong problem-solving skills and the ability to think creatively and critically\nExcellent communication and collaboration skills, with the ability to work effectively with technical and non-technical stakeholders",
    "Job Title": "Backend Developer",
    "Location": "Hyderabad",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T23:06:35.636Z",
    "Search Experience": "0",
    "Search Location": "Hyderabad",
    "Search Query": "Backend Developer",
    "Skills": "web application architecture, dbms, ajax, jquery, sql, database design, java, git, ruby rails, rails, debugging, technical specifications, html, mysql, api, mongodb, communication skills, architecture, rest, python, backend development, javascript, ruby, node.js, aws",
    "firstScraped": "2025-05-04T23:12:47.591Z",
    "lastUpdated": "2025-05-04T23:12:47.591Z"
  },
  {
    "_id": "6817f46ff8e721138d29a3e2",
    "Job URL": "https://www.naukri.com/job-listings-backend-developer-ibm-india-pvt-limited-hyderabad-3-to-5-years-210425909765",
    "Application Type": "Internal",
    "Company Name": "IBM",
    "Experience Required": "3-5 Yrs",
    "Job Description": "As a IBM Spectrum LSF Backend Software Developer, you will be responsible for designing and developing components and features for IBM Spectrum LSF, and would be involved in designing , developing and discussing product delivery & strategy. You should also have leadership quality to manage and work as technical leads/software architect and be able to deliver end to end features.\n\nAs part of worldwide development team, you will be collaborating with team members and clients from different timezone to support business success.\n\nYou will be addressing product issues reported from clients and providing solutions of fixes in timely manner. Be an avid coder who can get his hands dirty and be involved in the coding to the deepest level. Work other developers in the dev team to maintain and improve code base. Work in an Agile environment of continuous deliverable. Youll learn directly from Sr members/leaders in this field\n\n\nRequired education\nBachelor's Degree\n\nRequired technical and professional expertise",
    "Job Title": "Backend Developer",
    "Location": "Hyderabad",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T23:06:27.465Z",
    "Search Experience": "0",
    "Search Location": "Hyderabad",
    "Search Query": "Backend Developer",
    "Skills": "c++, linux, python, c, aws, container, css, screening, technical leadership, sourcing, docker, system administration, react.js, java, git, gcp, recruitment, html, software development, kernel, microsoft azure, backend development, linux kernel, javascript, agile",
    "firstScraped": "2025-05-04T23:12:47.591Z",
    "lastUpdated": "2025-05-04T23:12:47.591Z"
  },
  {
    "_id": "6817f46ff8e721138d29a3e1",
    "Job URL": "https://www.naukri.com/job-listings-backend-developer-ibm-india-pvt-limited-hyderabad-5-to-10-years-210425909777",
    "Application Type": "Internal",
    "Company Name": "IBM",
    "Experience Required": "5-10 Yrs",
    "Job Description": "As a IBM Spectrum LSF Backend Software Developer, you will be responsible for designing and developing components and features for IBM Spectrum LSF, and would be involved in designing , developing and discussing product delivery & strategy. You should also have leadership quality to manage and work as technical leads/software architect and be able to deliver end to end features.\n\nAs part of worldwide development team, you will be collaborating with team members and clients from different timezone to support business success.\n\nYou will be addressing product issues reported from clients and providing solutions of fixes in timely manner. Be an avid coder who can get his hands dirty and be involved in the coding to the deepest level. Work other developers in the dev team to maintain and improve code base. Work in an Agile environment of continuous deliverable. Youll learn directly from Sr members/leaders in this field\n\n\nRequired education\nBachelor's Degree\n\nRequired technical and professional expertise",
    "Job Title": "Backend Developer",
    "Location": "Hyderabad",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T23:06:19.261Z",
    "Search Experience": "0",
    "Search Location": "Hyderabad",
    "Search Query": "Backend Developer",
    "Skills": "c++, linux, python, c, aws, container, css, screening, technical leadership, sourcing, docker, system administration, react.js, java, git, gcp, recruitment, html, software development, kernel, microsoft azure, backend development, linux kernel, javascript, agile",
    "firstScraped": "2025-05-04T23:12:47.591Z",
    "lastUpdated": "2025-05-04T23:12:47.591Z"
  },
  {
    "_id": "6817f46ff8e721138d29a3e0",
    "Job URL": "https://www.naukri.com/job-listings-backend-developer-ilensys-technologies-hyderabad-8-to-13-years-210325502908",
    "Application Type": "Internal",
    "Company Name": "Ilensys Technologies",
    "Experience Required": "8-13 Yrs",
    "Job Description": "Upcoming Webinar: Join our webinar on Global Product Regulatory Trends and Updates 2025 for insights into key ...\nRegister Now\nBackend Developer\nHyderabad\nJob Posted: February 25, 2025\nExperience: 10-15(years)\nJob Type: Permanent\nQualifications: BE/BTech in Computer Science/IT or MCA\nAbout iLenSys:\niLenSys is a global professional services company with leading capabilities in digital technology service. Combining unmatched experience and specialized skills various industries, We are a trusted Digital Engineering and Enterprise Modernization partner, combining deep technical expertise and industry experience to help our clients anticipate what s next. we offerings Technology operations services and proven solutions create a unique competitive advantage for our clients by giving them the power to see beyond.\nJob Summary:\nA 10+ years experience in back-end development activities. Should take responsibility for code development, code quality, documentation, and unit testing.\nStrong hands-on experience in developing web-based applications.\nAble to comprehend all the stack holder requirements and develop software solutions based on the requirements.\nStrong grasp of Software development, testing methodologies and tools used.\nAbility to use wide variety of open-source technologies and tools.\nReady to adapt / learn new programming language / tools / framework based on project requirement.\nHave self-initiative and leadership qualities, take responsibility for project planning, tracking and delivery of project on-time.\nShould have strong knowledge in web-based application development preferably in PHP Laravel\nGood understanding of Web application architecture like MVC, MVVM, SPA etc, should be able to choose right architecture for the given problem.\nShould be able to design database design based on the application requirement and strong in SQL and related tools.\nExpertise in Web application security, specifically for cloud-based Applications.\nAble to provide technical leadership to a team of software engineers.\nGood communication skills, able to interact with all the stake holders and keep everyone informed on the project progress.\nGood understanding of software development process, quality processes (Agile / Scrum, CMMI, Release / Configuration management, metrics etc)\nSubscribe\nSubscribe to our Newsletter and Product Service Updates.\nBusiness Email\nFirst Name\nLast Name\nInterested In\nSubscription Preferences:\nNewsletters\nProduct and Service Updates\nBy submitting, I agree to receive newsletters and updates from iLenSys Technologies and can unsubscribe at any time. View\n\n\nLet us know how we can help you!\nWed love to hear from you\nOur websites require some cookies to function properly (required). In addition, other cookies may be used with your consent to analyze site usage, improve the user experience and for advertising.",
    "Job Title": "Backend Developer",
    "Location": "Hyderabad",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T23:06:11.211Z",
    "Search Experience": "0",
    "Search Location": "Hyderabad",
    "Search Query": "Backend Developer",
    "Skills": "ISO, Database design, Configuration management, PHP, CMMI, Application development, MVC, Open source, Analytics, SQL",
    "firstScraped": "2025-05-04T23:12:47.591Z",
    "lastUpdated": "2025-05-04T23:12:47.591Z"
  },
  {
    "_id": "6817f46ff8e721138d29a3df",
    "Job URL": "https://www.naukri.com/job-listings-backend-developer-fort-technologies-kolkata-mumbai-new-delhi-hyderabad-pune-chennai-bengaluru-1-to-3-years-300724502061",
    "Application Type": "Internal",
    "Company Name": "Fort Technologies",
    "Experience Required": "1-3 Yrs",
    "Job Description": "We are seeking a highly skilled Back End Developer to join our dynamic team. The ideal candidate will have a strong background in API development and be proficient in various technologies and frameworks. This role involves the development and maintenance of APIs, ensuring robust security, and integrating with Azure services.\nKey Responsibilities:\n- Develop APIs using Spring Boot 3.2.\n- Utilize the Dapr runtime system for application development.\n- Manage and maintain code using Git repositories.\n- Work proficiently with the Eclipse IDE.\n- Implement Swagger 3 (OpenAPI 3) for API documentation.\n- Write and maintain unit tests using frameworks like JUnit or TestNG.\n- Implement object validation using libraries such as Hibernate Validator.\n- Design and develop RESTful APIs adhering to best practices and standards.\n- Understand and apply the HTTP standard, including response codes.\n- Use Docker for containerizing APIs.\n- Implement OAuth to secure API endpoints.\n- Configure Azure EazyAuth for securing container apps.\nRequired Qualifications:\n- Proficiency in Spring Boot 3.2 for API development.\n- Experience with the Dapr runtime system.\n- Strong knowledge of Git and version control practices.\n- Expertise with the Eclipse IDE.\n- Ability to implement and manage Swagger 3 (OpenAPI 3).\n- Experience with unit testing frameworks such as JUnit or TestNG.\n- Knowledge of Hibernate Validator for object validation.\n- Strong understanding of RESTful standards and HTTP protocols.\n- Experience with Docker and containerization.\n- Ability to implement OAuth for securing APIs.\n- Knowledge of Azure EazyAuth configuration.\nPreferred Qualifications:\n- Experience working with core Azure services, including:\n- Azure Container App\n- Log Analytics\n- App Configuration Service\n- Application Insights\n- Azure Monitor\n- Container Registry\n- Event Grid\n- Key Vault\n- Service Bus\n- Azure DevOps repositories and pipelines\n- Azure API Management (APIM)\nSkills:\n- Strong problem-solving skills and attention to detail.\n- Excellent communication and teamwork skills.\n- Ability to work in a fast-paced environment and manage multiple tasks.",
    "Job Title": "Backend Developer",
    "Location": "Hyderabad, Kolkata, Mumbai, New Delhi, Pune, Chennai, Bengaluru",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T23:06:03.119Z",
    "Search Experience": "0",
    "Search Location": "Hyderabad",
    "Search Query": "Backend Developer",
    "Skills": "spring boot, Hibernate, GIT, Version control, Eclipse, devops, HTTP, Application development, Unit testing, Management",
    "firstScraped": "2025-05-04T23:12:47.591Z",
    "lastUpdated": "2025-05-04T23:12:47.591Z"
  },
  {
    "_id": "6817f46ff8e721138d29a3de",
    "Job URL": "https://www.naukri.com/job-listings-backend-developer-metadrob-mumbai-new-delhi-hyderabad-jaipur-bengaluru-1-to-2-years-071024502876",
    "Application Type": "Internal",
    "Company Name": "Metadrob",
    "Experience Required": "1-2 Yrs",
    "Job Description": "Design, develop, and maintain robust and scalable backend APIs using Node.js,\nExpress, and MongoDB (Mongoose)\nImplement secure and efficient data storage and retrieval mechanisms\nImprove and optimize the existing cloud-based architecture to ensure high\navailability, performance, and cost-effectiveness\nEnsure high availability and performance of backend systems\nDevelop and document robust APIs for efficient communication with front-end\napplications\nIntegrate with third-party APIs and services\nWrite clean, well-documented, and maintainable code\nParticipate in code reviews and knowledge sharing sessions\nStay up-to-date with the latest backend development trends and technologies\nQualifications :\nProven experience as a Backend Developer with at least 2 year of experience.\nStrong understanding of software development principles and best practices.\nIn-depth knowledge of Node.js, Express, and MongoDB (Mongoose).\nFamiliarity with AWS cloud services for hosting and deployment (preferred)\nExperience in Cloud-based Architecture improvement (e.g., scaling, optimization)\nSolid understanding of API development and integration principles.\nExperience with API integration (a plus).\nBonus Skills :\nFamiliarity with AI/NLP libraries and frameworks (TensorFlow, PyTorch, spaCy, etc.).\nKnowledge of geo-location APIs (Google Maps Platform, HERE Maps API, etc.).\nExperience with unit testing frameworks (Jest, Mocha, etc.).\nTech Stack :\nFrontend: React, Redux\nBackend: Node.js, Express.js\n3D Development: Three.js, React Three Fiber\nState Management: Redux\nCloud Services: AWS (Amazon Web Services)\nDatabase: MongoDB, Mongoose\nHosting & Deployment: Experience with Self-hosting on AWS VPS (a plus)",
    "Job Title": "Backend Developer",
    "Location": "Hyderabad, Mumbai, New Delhi, Jaipur, Bengaluru",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T23:05:55.182Z",
    "Search Experience": "0",
    "Search Location": "Hyderabad",
    "Search Query": "Backend Developer",
    "Skills": "Backend, Front end, Web services, Cloud Services, Javascript, Deployment, MongoDB, Unit testing, AWS, google maps",
    "firstScraped": "2025-05-04T23:12:47.591Z",
    "lastUpdated": "2025-05-04T23:12:47.591Z"
  },
  {
    "_id": "6817f46ff8e721138d29a3dd",
    "Job URL": "https://www.naukri.com/job-listings-backend-developer-ntrix-innovations-kolkata-mumbai-new-delhi-hyderabad-pune-chennai-bengaluru-8-to-13-years-130225507226",
    "Application Type": "Internal",
    "Company Name": "Ntrix Innovations",
    "Experience Required": "8-13 Yrs",
    "Job Description": "Degree in Computer Science or equivalent and 6-9 years of software development experience developing critical applications in a production Linux environment\nStrong technical skills in design patterns, build tools, GIT, SQL and Linux\nStrong coding skills with 1 or more programming languages\nGood understanding of data structure and algorithms\nKnowledge of Python or Machine Learning is good to have\nStrong debugging/diagnostic, problem-solving and analytical skills\nExperience with the entire software development lifecycle including requirements, specification, documentation, testing, release, and maintenance\nKnowledge and prior work experience in data modelling, security, performance, and scalability\nAbility to work independently and with a team\nCan learn and implement new technologies quickly and effectively\nExcellent communication and interpersonal skills",
    "Job Title": "Backend Developer",
    "Location": "Hyderabad, Kolkata, Mumbai, New Delhi, Pune, Chennai, Bengaluru",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T23:05:47.383Z",
    "Search Experience": "0",
    "Search Location": "Hyderabad",
    "Search Query": "Backend Developer",
    "Skills": "Computer science, Interpersonal skills, Backend, Linux, Diagnostics, Coding, MySQL, Debugging, Data structures, SQL",
    "firstScraped": "2025-05-04T23:12:47.591Z",
    "lastUpdated": "2025-05-04T23:12:47.591Z"
  },
  {
    "_id": "6817f46ff8e721138d29a3dc",
    "Job URL": "https://www.naukri.com/job-listings-backend-developer-picarro-kolkata-mumbai-new-delhi-hyderabad-pune-chennai-bengaluru-6-to-8-years-050225501182",
    "Application Type": "Internal",
    "Company Name": "Picarro Technologies",
    "Experience Required": "6-8 Yrs",
    "Job Description": "Job Overview:\nAs a Backend Developer, you will be crucial in the development, optimization, and maintenance of the server-side logic for our cloud-based SaaS applications. You will work closely with front-end developers to ensure system consistency and improve user experience. Your role will focus on writing clean, scalable code to enhance the functionality and performance of our applications.\nResponsibilities:\nDevelop and maintain scalable and robust backend services and APIs.\nCollaborate with front-end developers to integrate user-facing elements with server-side logic.\nOptimize applications for maximum speed and scalability.\nImplement security and data protection measures.\nDesign and implement data storage solutions.\nManage cutting-edge technologies to improve legacy applications.\nGather and address technical and design requirements.\nBuild reusable code and libraries for future use.\nLiaise with developers, designers, and system administrators to identify new features.\nWrite clean, modular, and well-documented code following best practices and coding standards.\nDesign and manage databases, including schema creation, queries, and optimization for relational or NoSQL databases.\nDevelop and execute unit tests to ensure code quality, reliability, and robustness.\nMaintain technical documentation and participate in code reviews to foster knowledge sharing and uphold code quality.\nOptimize application performance and troubleshoot system issues to improve functionality.\nFollow emerging technologies and frameworks.\nQualifications:\nBachelor s degree in computer science, Engineering, or a related field.\n6-8 years of experience as a backend developer\nProven experience as a Backend Developer or similar role.\nExperience with server-side languages such as Node.js, Python or Java.\nFamiliarity with front-end languages and libraries (e.g., HTML/CSS, JavaScript, XML, jQuery).\nGood Understanding of Microservices architecture.\nHands-on experience with database technology such as MySQL.\nDeep understanding of microservices architecture and RESTful API design.\nStrong understanding of version control tools like Git.\nFamiliarity with cloud platforms like AWS, and CI/CD tools.\nSome experience with Data streaming technologies like Kafka and Spark streaming for large scale data processing\nGood problem-solving skills and ability to perform well in a team-oriented environment.\nProficient understanding of code versioning tools, such as Git.\nNice to Have :\nExperience with Docker / Kubernetes\nExperience collaborating with remote teams across time Zones.\nFamiliarity with Agile development methodologies.",
    "Job Title": "Backend Developer",
    "Location": "Hyderabad, Kolkata, Mumbai, New Delhi, Pune, Chennai, Bengaluru",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T23:05:39.672Z",
    "Search Experience": "0",
    "Search Location": "Hyderabad",
    "Search Query": "Backend Developer",
    "Skills": "Backend, jQuery, Front end, Coding, XML, MySQL, HTML, Python, Technical documentation",
    "firstScraped": "2025-05-04T23:12:47.591Z",
    "lastUpdated": "2025-05-04T23:12:47.591Z"
  },
  {
    "_id": "6817f46ff8e721138d29a3db",
    "Job URL": "https://www.naukri.com/job-listings-backend-developer-idea-elan-kolkata-mumbai-new-delhi-hyderabad-pune-chennai-bengaluru-4-to-6-years-110425503152",
    "Application Type": "Internal",
    "Company Name": "Idea Elan",
    "Experience Required": "4-6 Yrs",
    "Job Description": "We are a product based company that provides comprehensive software solutions for research facilities in Universities and Institutions worldwide.\nPlease visit www.IdeaElan.com for more information.\n\nKey responsibilities\n\nDesign and develop high-performance, scalable, and secure backend APIs and services using .NET Core.\nWork with relational (MS-SQL) and NoSQL (Cosmos DB, MongoDB) databases to create optimized data models and ensure data consistency and performance.\nParticipate in code reviews and provide constructive feedback.\nCollaborate with front-end developers and other teams to deliver high-quality software.\nWrite clean, maintainable, and efficient code while ensuring quality standards.\nTroubleshoot and debug complex issues, optimizing code for maximum performance and scalability.\nStay updated with the latest trends in backend development and cloud technologies to drive innovation.\nOptimize database performance and ensure data integrity.\n\nRequired Experience\n\n4-6 years of experience in backend development.\nStrong experience with .NET Core and building RESTful APIs.\nProficient with MS-SQL and experience working with NoSQL databases like Cosmos DB and MongoDB.\nHands-on experience with Azure Cloud services (e.g., Azure Functions, Azure Storage, API Management, Azure SQL Database, etc.).\nUnderstanding of software development principles such as object-oriented programming (OOP), design patterns, and SOLID principles.\nExperience with version control systems such as Git.\nStrong knowledge of asynchronous programming, microservices architecture, and cloud-native application design.\nFamiliarity with CI/CD pipelines, containerization (Docker), and deployment automation is a plus.\nExcellent problem-solving and debugging skills.\nAbility to work in an Agile development environment and collaborate with cross-functional teams.\nGood communication and collaboration skills.",
    "Job Title": "Backend Developer",
    "Location": "Hyderabad, Kolkata, Mumbai, New Delhi, Pune, Chennai, Bengaluru",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T23:05:31.909Z",
    "Search Experience": "0",
    "Search Location": "Hyderabad",
    "Search Query": "Backend Developer",
    "Skills": "Automation, MS SQL, Backend, Front end, Version control, GIT, NoSQL, MongoDB, data integrity, Cosmos",
    "firstScraped": "2025-05-04T23:12:47.591Z",
    "lastUpdated": "2025-05-04T23:12:47.591Z"
  },
  {
    "_id": "6817f46ff8e721138d29a3da",
    "Job URL": "https://www.naukri.com/job-listings-backend-developer-photon-infotech-p-ltd-kolkata-mumbai-new-delhi-hyderabad-pune-chennai-bengaluru-3-to-6-years-121124506331",
    "Application Type": "Internal",
    "Company Name": "Photon",
    "Experience Required": "3-6 Yrs",
    "Job Description": "We are looking for a skilled Backend Developer to join our team. In this role, you will be responsible for designing, developing, and maintaining the server-side components of our web applications. You will collaborate with frontend developers and other stakeholders to ensure seamless integration and optimal performance of our systems. If you are passionate about backend technologies and have a strong problem-solving mindset, we want to hear from you\nKey Responsibilities:\n- Application Development: Design and implement robust and scalable backend services using programming languages and frameworks such as Java, Python, Node.js, or Ruby.",
    "Job Title": "Backend Developer",
    "Location": "Hyderabad, Kolkata, Mumbai, New Delhi, Pune, Chennai, Bengaluru",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T23:05:24.054Z",
    "Search Experience": "0",
    "Search Location": "Hyderabad",
    "Search Query": "Backend Developer",
    "Skills": "Product management, Postgresql, MySQL, Debugging, Agile, Application development, Ruby, SQL, Python",
    "firstScraped": "2025-05-04T23:12:47.591Z",
    "lastUpdated": "2025-05-04T23:12:47.591Z"
  },
  {
    "_id": "6817f46ff8e721138d29a3d9",
    "Job URL": "https://www.naukri.com/job-listings-backend-developer-sunking-kolkata-mumbai-new-delhi-hyderabad-pune-chennai-bengaluru-1-to-2-years-220425500582",
    "Application Type": "Internal",
    "Company Name": "Sun King",
    "Experience Required": "1-2 Yrs",
    "Job Description": "Job location: Remote in India\n\nAbout the role:\nThe Backend Developer works remotely as part of the technology team to help Sun King s EasyBuy business unit design and develop software to improve its field team operations.\nWhat you will be expected to do\nDesign and develop applications/systems based on wireframes and product requirements documents.\nDesign and develop logical and physical data models to meet application requirements.\nIdentify and resolve bottlenecks and bugs based on operational requirements.\nPerform unit tests on code to ensure robustness, including edge cases, usability, and general reliability.\nWrite reusable and easily maintainable code following the principles of DRY (Don t Repeat Yourself).\nIntegrate existing tools and business systems, both in-house and external services, such as ticketing software and communication tools.\nCollaborate with team members and product managers to understand project requirements and contribute to the overall system design.\nYou might be a strong candidate if you have/are\nHave development experience: 1-2 years backend development experience and have strong problem-solving abilities, proficiency in data structures, and algorithms.\nHave a profound grasp of object-oriented programming (OOPS) standards and expertise in Core Java.\nHave knowledge of SQL, MySQL, or similar database management.\nHave Experience in integrating web services, such as SOAP, REST, JSON, and XML.\nHave familiarity with RESTful APIs for linking Android applications to backend services.\nHave preferred experience with version control systems like Git, but not mandatory.\nHave additional knowledge of web technologies like HTML, CSS, JavaScript, and frameworks like Spring or Hibernate would be advantageous.",
    "Job Title": "Backend Developer",
    "Location": "Hyderabad, Kolkata, Mumbai, New Delhi, Pune, Chennai, Bengaluru",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T23:05:15.975Z",
    "Search Experience": "0",
    "Search Location": "Hyderabad",
    "Search Query": "Backend Developer",
    "Skills": "Hibernate, Core Java, XML, MySQL, Javascript, Data structures, HTML, JSON, SQL, Android",
    "firstScraped": "2025-05-04T23:12:47.591Z",
    "lastUpdated": "2025-05-04T23:12:47.591Z"
  },
  {
    "_id": "6817f46ff8e721138d29a3d8",
    "Job URL": "https://www.naukri.com/job-listings-backend-developer-ibm-india-pvt-limited-hyderabad-1-to-3-years-220425911605",
    "Application Type": "Internal",
    "Company Name": "IBM",
    "Experience Required": "1-3 Yrs",
    "Job Description": "As a IBM Spectrum LSF Backend Software Developer, you will be responsible for designing and developing components and features for IBM Spectrum LSF, and would be involved in designing , developing and discussing product delivery & strategy. You should also have leadership quality to manage and work as technical leads/software architect and be able to deliver end to end features.\n\nAs part of worldwide development team, you will be collaborating with team members and clients from different timezone to support business success.\n\nYou will be addressing product issues reported from clients and providing solutions of fixes in timely manner. Be an avid coder who can get his hands dirty and be involved in the coding to the deepest level. Work other developers in the dev team to maintain and improve code base. Work in an Agile environment of continuous deliverable. Youll learn directly from Sr members/leaders in this field\n\n\nRequired education\nBachelor's Degree\n\nRequired technical and professional expertise",
    "Job Title": "Backend Developer",
    "Location": "Hyderabad",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T23:05:08.200Z",
    "Search Experience": "0",
    "Search Location": "Hyderabad",
    "Search Query": "Backend Developer",
    "Skills": "c++, linux, python, c, aws, container, css, screening, technical leadership, sourcing, docker, system administration, react.js, java, git, gcp, recruitment, html, software development, kernel, microsoft azure, backend development, linux kernel, javascript, agile",
    "firstScraped": "2025-05-04T23:12:47.591Z",
    "lastUpdated": "2025-05-04T23:12:47.591Z"
  },
  {
    "_id": "6817f46ff8e721138d29a3d7",
    "Job URL": "https://www.naukri.com/job-listings-backend-developer-with-strong-dsa-bct-consulting-hyderabad-1-to-6-years-020525017253",
    "Application Type": "Internal",
    "Company Name": "Bahwan CyberTek",
    "Experience Required": "1-6 Yrs",
    "Job Description": "About the Role\nWe are looking for a passionate and skilled Backend Developer with a strong foundation in Data Structures and Algorithms. You will be responsible for designing and implementing scalable backend systems, optimizing performance, and ensuring robustness and security across our services. This role is ideal for someone who enjoys solving complex problems and building efficient systems.\nKey Responsibilities\nDesign, develop, and maintain high-performance, scalable, and secure server-side applications and APIs.\nWrite clean, maintainable code and implement automated tests.\nParticipate in architectural discussions and design reviews.\nSolve complex problems involving large-scale data processing, latency optimization, and efficient storage.\nCollaborate with cross-functional teams to define and deliver features end-to-end.\nUse a deep understanding of data structures and algorithms to write optimized and performant code.\nPerform code reviews and mentor junior developers when needed.\nRequirements\nStrong proficiency in at least one backend language: Java, Python, Go, Node.js, .net, C++, etc.\nSolid understanding of Data Structures and Algorithms (will be assessed during interviews).\nExperience with RESTful APIs, microservices architecture, and server-side development.\nProficiency in relational and/or NoSQL databases (e.g., PostgreSQL, MySQL, MongoDB).\nGood understanding of distributed systems and system design concepts.\nFamiliarity with version control systems (Git), CI/CD pipelines, and cloud platforms (AWS, GCP, or Azure).\nStrong problem-solving and analytical skills.\nNice to Have\nParticipation in competitive programming or algorithmic contests (Codeforces, LeetCode, HackerRank).\nExperience with Kubernetes, Docker, or other container orchestration tools.\nKnowledge of message queues like Kafka, RabbitMQ.",
    "Job Title": "Backend Developer with Strong DSA",
    "Location": "Hyderabad",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T23:04:59.542Z",
    "Search Experience": "0",
    "Search Location": "Hyderabad",
    "Search Query": "Backend Developer",
    "Skills": "DSA, java, Data Structures And Algorithms, Backend, Data structures, Development, Algorithms, Data",
    "firstScraped": "2025-05-04T23:12:47.591Z",
    "lastUpdated": "2025-05-04T23:12:47.591Z"
  },
  {
    "_id": "6817ab41f8e721138d29a38e",
    "Job URL": "https://www.naukri.com/job-listings-data-analytics-internship-collegetips-in-chennai-delhi-ncr-bengaluru-0-to-2-years-210425916313",
    "Application Type": "Internal",
    "Company Name": "Collegetips",
    "Experience Required": "0-2 Yrs",
    "Job Description": "1. Analyze and interpret data to provide insights and make recommendations for improving student engagement and performance.\n2. Collaborate with cross-functional teams to develop data-driven solutions for various projects and initiatives.\n3. Assist in the design and implementation of data collection processes to ensure accuracy and reliability.\n4. Use statistical techniques to identify trends and patterns in data sets to enhance marketing strategies and user experience.\n5. Develop visualizations and dashboards to communicate findings and insights effectively to stakeholders.\n6. Stay current on industry trends and best practices in data analytics to continuously improve skills and knowledge.\n7. Contribute to a culture of innovation and excellence by sharing ideas and insights with the team.\nLocation: Delhi NCR,Bangalore,Chennai,Pune,Kolkata,Ahmedabad,Mumbai,Hyderabad",
    "Job Title": "Data Analytics Internship",
    "Location": "Chennai, Bengaluru, Delhi / NCR",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T17:59:17.589Z",
    "Search Experience": "1",
    "Search Location": "Bangalore",
    "Search Query": "Data Analyst",
    "Skills": "Data Analytics, Google Sheets, Power BI, Tableau, Python, SQL, Bi, Google",
    "firstScraped": "2025-05-04T18:00:33.539Z",
    "lastUpdated": "2025-05-04T18:00:33.539Z"
  },
  {
    "_id": "6817ab41f8e721138d29a38d",
    "Job URL": "https://www.naukri.com/job-listings-junior-analyst-business-process-applied-data-finance-hyderabad-chennai-bengaluru-0-to-2-years-300425911494",
    "Application Type": "Internal",
    "Company Name": "Applied Data Finance",
    "Experience Required": "0-2 Yrs",
    "Job Description": "Core Technical Skills:\nStrong ability to create and optimize complex queries for analysis using Amazon Redshift or similar database services.\nSkilled in Python scripting to develop and maintain automation scripts, monitoring tools, and alerts.\nAbility to translate business needs to technical specifications, understand the requirements thoroughly and work closely with internal stakeholders to ensure the deliverability on time with great quality.\nAbility to create and manage database tables, maintain data integrity, and generate reports for ongoing monitoring and analysis.\nAbility to analyse and monitor the automated reports and be proactive in capturing any issues.\nAbility to interpret data and turn it into analytical reports which can offer ways to improve a business, thus affecting business decisions.\nRoles and Responsibilities:\nEvaluate, refine, and improve existing monitoring frameworks and processes.\nCollaborate with cross-functional teams to integrate systems and develop end-to-end monitoring solutions.\nAssist in converting semi-automated processes to fully automated frameworks using SQL, Python, and alerting systems.\nMaintain, update, and improve SQL and Python scripts for enhanced efficiency and process reliability.\nDevelop database queries, conduct data analysis, and create visualizations and reports that support decision-making\nSummarizing the monitoring reports to Managers on a daily and monthly basis\nTaking part in the daily stand-up and provide updates\nTaking part in release demos and product walk-through sessions\nSoft Skills:\nStrong verbal and written communication skills to clearly document processes, communicate issues, and collaborate across teams.\nAbility to function as both an individual contributor and a collaborative team member.\nAnalytical mindset, attention to detail, and self-motivated to learn new skills and tools as required by team needs.",
    "Job Title": "Junior Analyst - Business Process",
    "Location": "Hyderabad, Chennai, Bengaluru",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T17:58:40.819Z",
    "Search Experience": "1",
    "Search Location": "Bangalore",
    "Search Query": "Data Analyst",
    "Skills": "Business Analysis, data analysis, Amazon Redshift, create visualizations, SQL, Python, Data, Process",
    "firstScraped": "2025-05-04T18:00:33.539Z",
    "lastUpdated": "2025-05-04T18:00:33.539Z"
  },
  {
    "_id": "6817ab41f8e721138d29a38c",
    "Job URL": "https://www.naukri.com/job-listings-te-oracle-consultanat-kpmg-assurance-and-consulting-services-llp-gurugram-bengaluru-mumbai-all-areas-0-to-2-years-020525006779",
    "Application Type": "Internal",
    "Company Name": "KPMG Assurance and Consulting Services LLP",
    "Experience Required": "0-2 Yrs",
    "Job Description": "Job description:\n\nOracle Financials Functional Consultant:\nImplementing Oracle ERP for the clients post taking the business requirement across processes such as Record to Report, Source to Pay, Order to Cash etc\nBuilding and supporting specific solutions on Oracle for the client needs encompassing Business Processes, Regulatory updates, Accounting Standards, Indirect Tax, Internal Controls or Automations\nEnd to end journey on Oracle implementation starting from sales support to requirement mapping, solution design, tech design, testing, migration and post go-live support\nSupport on regulatory updates/ industry specific challenges to the client\nGood communication skills\nOpen to travel in India and abroad\n\nOracle EPM Functional Consultant:\n\na) Implementing Oracle EPM for the clients post taking the business requirement across processes such as Consolidation, Planning, Tax Reporting, Annual Reporting, Reconciliations\nb) Building and supporting specific solutions on Oracle EPM for the client needs encompassing Business Processes, Regulatory updates, Accounting Standards, Direct Tax, Internal Controls or Automations\nc) End to end journey on Oracle implementation starting from sales support to requirement mapping, solution design, tech design, testing, migration and post go-live support\nd) Support on regulatory updates/ industry specific challenges to the client\ne) Good communication skills\nf) Open to travel in India and abroad",
    "Job Title": "TE Oracle/ Consultanat",
    "Location": "Mumbai (All Areas), Bengaluru, Gurugram",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T17:58:04.347Z",
    "Search Experience": "1",
    "Search Location": "Bangalore",
    "Search Query": "Data Analyst",
    "Skills": "Oracle Financials, Finance, Process Improvement, technical accounting, Communication Skills, Financial Technology, Data Analysis, ERP Systems",
    "firstScraped": "2025-05-04T18:00:33.539Z",
    "lastUpdated": "2025-05-04T18:00:33.539Z"
  },
  {
    "_id": "6817ab41f8e721138d29a38b",
    "Job URL": "https://www.naukri.com/job-listings-business-analytics-internship-collegetips-in-mumbai-delhi-ncr-bengaluru-0-to-2-years-280425917980",
    "Application Type": "Internal",
    "Company Name": "Collegetips",
    "Experience Required": "0-2 Yrs",
    "Job Description": "1. Assist in collecting, organizing, and analyzing data using MS-Excel.\n2. Develop reports and dashboards to present key metrics and trends.\n3. Conduct market research and competitor analysis to identify opportunities.\n4. Collaborate with cross-functional teams to understand business needs.\n5. Assist in developing strategies to improve user engagement and retention.\n6. Support in optimizing marketing campaigns based on data-driven insights.\n7. Take part in ad hoc projects and tasks related to business analytics and operations.\nLocation - Remote, work from home, part time, Hyderabad,ahmedabad,pune,chennai,kolkata,Delhi / NCR,Mumbai,Bengaluru.",
    "Job Title": "Business Analytics Internship",
    "Location": "Mumbai, Bengaluru, Delhi / NCR",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T17:57:19.924Z",
    "Search Experience": "1",
    "Search Location": "Bangalore",
    "Search Query": "Data Analyst",
    "Skills": "Business Analytics, Business analysis, Excel, MySQL, SAS, Natural Language Processing, Tableau, Statistics, Deep Learning, SQL, Business Communication, Data Science, Clinical Trial Analysis",
    "firstScraped": "2025-05-04T18:00:33.539Z",
    "lastUpdated": "2025-05-04T18:00:33.539Z"
  },
  {
    "_id": "6817ab41f8e721138d29a38a",
    "Job URL": "https://www.naukri.com/job-listings-accounting-business-operations-executive-quanterian-global-services-pune-chennai-bengaluru-0-to-5-years-280425924231",
    "Application Type": "Internal",
    "Company Name": "Quanterian Global Services",
    "Experience Required": "0-5 Yrs",
    "Job Description": "Accounting & Business Operations Executive | Company: Quanterian LLC | Location: Remote | Work Timing: 8:30 PM IST 5:00 AM IST (US Shift) |\nExperience: 0-5 Years |\nSalary: Competitive, Based on Experience | Employment Type: Full-Time |\nKey Responsibilities: Accounting & Financial Management: Maintain books of accounts and oversee financial transactions in QuickBooks, Tally, or Zoho Books Prepare and analyze financial statements (Balance Sheet, P&L, Cash Flow Statements) Manage accounts payable and receivable, ensuring timely payments and collections Process payroll via ADP/Zoho Payroll, handling salaries, reimbursements, and deductions\nConduct bank reconciliations, expense tracking, and financial reporting Assist in budgeting, forecasting, and variance analysis for cost control Support tax planning and compliance, including GST, TDS, and corporate tax filings.\nBusiness Operations & Process Optimization: Coordinate with vendors for procurement, contract negotiation, and payment processing Optimize operational workflows to enhance efficiency and reduce costs.\nCompliance & Documentation: Maintain accurate records for audits, tax filings, and compliance Assist in preparing reports for internal and external audits Ensure compliance with company policies, labor laws, and statutory regulations.\nReporting & Data Analysis: Generate MIS reports to support financial and operational decision-making Track KPIs and performance metrics, providing actionable insights.\nKey Skills & Qualifications Must-Have:\nBachelors degree in Accounting, Finance, Commerce (B.Com, M.Com, CA Inter, CMA Inter, MBA Finance, or equivalent)\nStrong knowledge of accounting principles, bookkeeping, and financial reporting Proficiency in QuickBooks, Tally, Zoho Books, or other accounting software\nHands-on experience with MS Excel (Pivot Tables, VLOOKUP, HLOOKUP, IF formulas)\nUnderstanding of GST, TDS, and basic tax compliance\nExcellent organizational, analytical, and problem-solving skills\nAbility to work independently in a remote setting.\nPreferred (for experienced candidates): Experience in financial planning, budgeting, and cost optimization\nAbility to negotiate with vendors and manage procurement\nKnowledge of ERP systems, ADP Payroll, or Zoho Payroll\nPrior experience in auditing, compliance, or business operations. Why Join Quanterian LLC\nRemote work opportunity with a fixed night shift (US hours)\nCareer growth in accounting, operations, and business strategy\nFast-paced, collaborative work environment with leadership exposure.\nLocation- Bengaluru,Chennai,Pune,Kolkata,Ahmedabad,Mumbai,Remote,Delhi NCR, Hyderabad",
    "Job Title": "Accounting & Business Operations Executive",
    "Location": "Pune, Chennai, Bengaluru",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T17:57:03.971Z",
    "Search Experience": "1",
    "Search Location": "Bangalore",
    "Search Query": "Data Analyst",
    "Skills": "Accounting Operations, Financial Statements, Bookkeeping, Accounting, Accounts Payable Accounts Receivable, business strategy, Business Operations, auditing, financial planning, Payroll Processing, budgeting",
    "firstScraped": "2025-05-04T18:00:33.539Z",
    "lastUpdated": "2025-05-04T18:00:33.539Z"
  },
  {
    "_id": "6817ab41f8e721138d29a389",
    "Job URL": "https://www.naukri.com/job-listings-data-engineer-henson-group-pune-chennai-bengaluru-0-to-1-years-300425912190",
    "Application Type": "Internal",
    "Company Name": "Henson Group",
    "Experience Required": "0-1 Yrs",
    "Job Description": "Collect and integrate data from multiple online data sources via API.\nClean, filter, and normalize datasets to ensure consistency and accuracy.\nDesign, develop, and maintain a centralized database in Microsoft Fabric.\nOptimize data pipelines for efficiency and scalability.\nCollaborate with stakeholders to understand data requirements and build out standard reports\nEnsure data security and compliance with industry standards. 100% hands-on development Microsoft Fabric, Azure SQL, and similar technologies:\ndevelop and unit test database code, including but not limited to T-SQL, stored procedures, functions and views.\nCreate and maintain database structures.\nParticipate in the design of databases, using first, second or third normalized form as needed to support business requirements.\nPerform analysis of complex data and document findings.\nPrepare data for prescriptive and predictive modeling.\nPlay a direct role in the maintenance, technical support, documentation, and administration of databases.\nProficiency in data integration and ETL processes, Strong knowledge of Microsoft Fabric and similar cloud-based data platforms, Expertise in SQL, Python, or other relevant programming languages, Experience with data warehousing, data modeling, and database design\nEducation - Degree in data science\nLocation-(Remote),Delhi NCR, Bengaluru, Chennai, Pune, Kolkata, Ahmedabad, Mumbai, Hyderabad",
    "Job Title": "Data Engineer",
    "Location": "Pune, Chennai, Bengaluru",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T17:56:39.725Z",
    "Search Experience": "1",
    "Search Location": "Bangalore",
    "Search Query": "Data Analyst",
    "Skills": "SQL, database design, technical support, data modeling, documentation, data warehousing, ETL, database administration, database structures, Python",
    "firstScraped": "2025-05-04T18:00:33.539Z",
    "lastUpdated": "2025-05-04T18:00:33.539Z"
  },
  {
    "_id": "6817ab41f8e721138d29a388",
    "Job URL": "https://www.naukri.com/job-listings-risk-advisory-data-analytics-analyst-kpmg-assurance-and-consulting-services-llp-bengaluru-0-to-2-years-140425010343",
    "Application Type": "Internal",
    "Company Name": "KPMG Assurance and Consulting Services LLP",
    "Experience Required": "0-2 Yrs",
    "Job Description": "About KPMG in India\nKPMG entities in India are professional services firm(s). These Indian member firms are affiliated with KPMG International Limited. KPMG was established in India in August 1993. Our professionals leverage the global network of firms, and are conversant with local laws, regulations, markets and competition. KPMG has offices across India in Ahmedabad, Bengaluru, Chandigarh, Chennai, Gurugram, Jaipur, Hyderabad, Jaipur, Kochi, Kolkata, Mumbai, Noida, Pune, Vadodara and Vijayawada. \nKPMG entities in India offer services to national and international clients in India across sectors. We strive to provide rapid, performance-based, industry-focused and technology-enabled services, which reflect a shared knowledge of global and local industries and our experience of the Indian business environment.\nTempHtmlFile\nJob Title: Analyst\nLocation: Gurgaon/Mumbai\n  Overview           \nTo drive and support the business change activities required to underpin Data Analyst simplification agenda. Shell is focused on aligning and simplifying Internal audit to increase business value which will drive significant and ongoing change in all parts of the business, supporting the business growth agenda.  The role is delivery focused and will lead Audit-driven business change in a programme or project environment.\nThe primary purpose of the role is to:\n       Work on Data Analytics activities and related languages like Python, SQL.\n       Work on advance excel and Tabular.\n       Work on BI tools and data handling activities.\n  Technical Skills & Experience\n       Individual contributor in Data handling project of client.\n       Have a good command on data Analytics.\no   Python\no   Power BI\no   Alteryx\no   SQL\nSoft Skills & Experience\n       High delivery impact in data handing activities\n       Process knowledge of business functions\n       Understanding of Data Analytics approaches\n       Proven track record of building strong stakeholder relationships at different organizational levels.\n       Able to produce high quality deliverables and activities.\n       Resilient and able to manage challenges in variety of work / sectors.\n       Results/outcomes-oriented way of working\n       Confident and able to work in any type of work environment.\n       Excellent oral and written presentation skills\nQualification:  BTech, BCA Graduate or any computer science graduate with 1-3 years of Data Analyst. experience. Certifications in Data Science would be preferred.\nSelection Process: 2 rounds of technical interview followed by business head.\n \nEqual employment opportunity information \n\nKPMG India has a policy of providing equal opportunity for all applicants and employees regardless of their color, caste, religion, age, sex/gender, national origin, citizenship, sexual orientation, gender identity or expression, disability or other legally protected status. KPMG India values diversity and we request you to submit the details below to support us in our endeavor for diversity. Providing the below information is voluntary and refusal to submit such information will not be prejudicial to you.",
    "Job Title": "Risk Advisory Data Analytics Analyst",
    "Location": "Bengaluru",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T17:56:31.661Z",
    "Search Experience": "1",
    "Search Location": "Bangalore",
    "Search Query": "Data Analyst",
    "Skills": "python, data analytics, data analysis, bi, predictive analytics, presentation skills, power bi, machine learning, business intelligence, sql, alteryx, analytics, excel, bi tools, tableau, data science, data modeling, advanced excel, predictive modeling, data visualization, statistics",
    "firstScraped": "2025-05-04T18:00:33.539Z",
    "lastUpdated": "2025-05-04T18:00:33.539Z"
  },
  {
    "_id": "6817ab41f8e721138d29a387",
    "Job URL": "https://www.naukri.com/job-listings-trainee-document-analyst-ontrack-kolkata-mumbai-new-delhi-hyderabad-pune-chennai-bengaluru-0-to-1-years-210425502855",
    "Application Type": "External",
    "Company Name": "Ontrack",
    "Experience Required": "0-1 Yrs",
    "Job Description": "This position offers an exciting opportunity for a Trainee - Data Analyst is pivotal in digital transformation and data management.\nOnsite work opportunity.\nIndia compensation is based upon the local competitive market.\nResponsibilities\nUnderstand project manual contents and executing the work as per client instructions.\nAchieve the production target fixed based on the project.\nRaise queries to troubleshooters and follow-up updates.\nQualifications\nA bachelors degree in computer science, information systems, information technology, or a similar degree.\nEffective communication skills to collaborate with cross-functional teams.\nWhy you'll Love KLD\nAt KLD we invest in employees and their families by placing their we'llbeing first. We offer competitive total compensation that includes base pay, bonus opportunity, inclusive benefits, we'llness programs, and perks. We use market and industry data to inform pay decisions while considering geography and labor markets, individual experience, and business needs.\nPaid time off, that offers various time off options to help employees maintain a work-life balance, such as Casual, Earned, Sick, Special Leave, and Holidays!\nOngoing learning and development, a focus on continuous professional development through various training and education reimbursement programs.\nA diverse and inclusive workplace where we all learn, grow, and achieve the greatest heights together.\nA surrounding team of mission-driven individuals who genuinely love what they do.\nFree, fun, interactive and incentivized global we'llness program that promotes the we'llbeing of our employees.\nOur Cultural Values\nEntrepreneurs at heart, we are a customer first team sharing one goal and one vision. We seek team members who are:\nHumble - No one is above another; we all work together to meet our clients needs and we acknowledge our own weaknesses\nHungry - We all are driven internally to be successful and to continually expand our contribution and impact\nSmart - We use emotional intelligence when working with one another and with clients",
    "Job Title": "Trainee, Document Analyst",
    "Location": "Hyderabad, Pune, Chennai, Mumbai, Bengaluru, Kolkata, New Delhi",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T17:52:44.507Z",
    "Search Experience": "1",
    "Search Location": "Bangalore",
    "Search Query": "Data Analyst",
    "Skills": "Computer science, Document review, Data management, Data recovery, Litigation, Data collection, Data processing, Wellness, Forensic, Information technology",
    "firstScraped": "2025-05-04T18:00:33.539Z",
    "lastUpdated": "2025-05-04T18:00:33.539Z"
  },
  {
    "_id": "6817ab41f8e721138d29a386",
    "Job URL": "https://www.naukri.com/job-listings-operations-analyst-sleek-tech-kolkata-mumbai-new-delhi-hyderabad-pune-chennai-bengaluru-0-to-3-years-290425503153",
    "Application Type": "External",
    "Company Name": "Sleek Tech",
    "Experience Required": "0-3 Yrs",
    "Job Description": "About Sleek\nThrough proprietary software and AI, along with a focus on customer delight, Sleek makes the back-office easy for micro SMEs.\nWe give Entrepreneurs time back to focus on what they love doing - growing their business and being with customers. With a surging number of Entrepreneurs globally, we are innovating in a highly lucrative space.\nWe operate 3 business segments:\nCorporate Secretary : Automating the company incorporation, secretarial, filing, Nominee Director, mailroom and immigration processes via custom online robots and SleekSign. We are the market leaders in Singapore with ~5% market share of all new business incorporations\nAccounting & Bookkeeping: Redefining what it means to do Accounting, Bookkeeping, Tax and Payroll thanks to our proprietary SleekBooks ledger, AI tools and exceptional customer service\nFinTech payments: Overcoming a key challenge for Entrepreneurs by offering digital banking services to new businesses\nSleek launched in 2017 and now has around 15,000 customers across our offices in Singapore, Hong Kong, Australia and the UK. We have around 450 staff with an intact startup mindset.\nWe have achieved >70% compound annual growth in Revenue over the last 5 years and as a result have been recognised by The Financial Times, The Straits Times, Forbes and LinkedIn as one of the fastest growing companies in Asia. Backed by world-class investors, we are on track to be one of the few cash flow positive, tech-enabled unicorns based out of Singapore.\n\nMission:\nThe Operations Analyst will act as a proactive driver of Sleek s FinTech operations, ensuring smooth product management, operational excellence, and continuous improvement of the Sleek Business Account (SBA). By combining strong operational insight with independent problem-solving and a focus on customer-centricity, the Operations Analyst will help build a best-in-class financial service experience.\nOutcomes:\nOperate independently with minimal supervision, managing assigned tasks and projects effectively across FinTech operations.\nDocument and track product requirements, customer feedback, defects, and project actions; maintain internal project management tools (e.g., RAID logs).\nOwn and deliver accurate weekly reporting on customer onboarding, transactions, revenues, and monthly active users (MAUs).\nIdentify operational issues and product defects, propose viable solutions, and coordinate timely resolution with relevant stakeholders.\nSupport transactional reconciliation activities, ensuring accuracy and consistency between banking data and Sleek s internal records.\nGradually take ownership of increasingly complex operational and project management tasks to drive continuous improvement across the Sleek Business Account.\n\n\nBachelor s degree in Banking, Finance, Engineering, or a related field.\nMinimum 2 years of relevant experience in Banking, Financial Services, FinTech, or Consulting.\nKnowledge of B2B payments, the FinTech industry, or fi",
    "Job Title": "Operations Analyst",
    "Location": "Hyderabad, Pune, Chennai, Mumbai, Bengaluru, Kolkata, New Delhi",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T17:52:36.786Z",
    "Search Experience": "1",
    "Search Location": "Bangalore",
    "Search Query": "Data Analyst",
    "Skills": "Data analysis, Payroll, Operational excellence, Project management, Reconciliation, Consulting, Back office, Customer service, Operations, Financial services",
    "firstScraped": "2025-05-04T18:00:33.539Z",
    "lastUpdated": "2025-05-04T18:00:33.539Z"
  },
  {
    "_id": "6817ab41f8e721138d29a385",
    "Job URL": "https://www.naukri.com/job-listings-data-scientist-azira-bengaluru-0-to-3-years-280425502817",
    "Application Type": "External",
    "Company Name": "Azira",
    "Experience Required": "0-3 Yrs",
    "Job Description": "Descriptions\nYou will be joining Azira, a global Consumer Insights platform, helping marketing and operational leaders improve their effectiveness with actionable intelligence to drive business results\nIts mission is to create a more relevant world where brands are empowered to reach and build relationships with their consumers\nWe are looking for a Data Scientist to join our growing team, working on cutting-edge analytics and machine learning solutions\nThis role is not just about research?it is about delivering business value\nThe ideal candidate will have experience moving from research to production, ensuring that data science solutions drive measurable impact\nYou will be responsible for developing models, deploying them at scale, and ensuring they deliver tangible results aligned with business milestones\nThis role reports to Head of Data Science\nA Day in the Life\nDesign and develop machine learning models (regression, classification, neural networks) that directly impact business outcomes\nWork with large-scale datasets using big data tools such as Spark to generate actionable insights\nTranslate research into production-ready solutions, ensuring scalability, reliability, and performance\nDeliver projects against defined business milestones, tracking progress and ensuring successful deployment\nOptimize SQL queries to analyze structured data within cloud data storage environments\nImplement data science solutions using Python and apply object-oriented programming (OOP) principles where necessary\nUtilize cloud computing frameworks (preferably AWS, but experience with GCP or Azure is acceptable) to deploy and manage machine learning workflows\nCollaborate with cross-functional teams, including engineers, business analysts, and product managers, to integrate models into production systems\nClearly communicate insights, technical solutions, and project progress to both technical and non-technical stakeholders\nWhat You Bring to the Role\nExperience: 3-4 years overall, with at least 1-2 years in a big data/analytics company\nStrong foundation in statistics and probability for data analysis and model evaluation\nHands-on experience with regression, classification, and neural network models in real-world applications\nProven ability to transition from research to production, ensuring ML models deliver business impact\nExperience delivering projects on time and aligned with business milestones\nProficiency in SQL for data extraction and manipulation within cloud data storage environments\nExperience with cloud computing frameworks, preferably AWS (GCP or Azure also acceptable)\nSolid knowledge of Python programming and basic object-oriented programming (OOP) concepts\nExperience working with big data tools like Spark for distributed data processing\nA data science professional aligns data initiatives with business goals, communicates insights effectively, solves problems creatively, and collaborates with cross-functional teams\nNice-to-Have Qualifications\nExperience with MLOps frameworks, such as MLflow, for managing machine learning lifecycles\nProficiency in R programming language for statistical analysis\nUnderstanding of CI/CD pipelines for machine learning deployment\nDomain knowledge of geospatial datasets and mobility data\nExperience with time series analysis for forecasting and trend detection\nBasic understanding of LLMs (Large Language Models) and Generative AI\nAbout Azira\nAzira LLC, a global Consumer Insights platform, helps marketing and operational leaders improve their effectiveness with actionable intelligence to drive business results\nIts mission is to create a more relevant world where brands are empowered to reach and build relationships with their consumers\nWith a profound commitment to partnership, trust and transparency, combined with decades of expertise in consumer behavioral analytics, Azira delivers innovative marketing solutions to curate audiences, activate omnichannel campaigns, and understand footfall attribution\nIt also provides operational insights for use cases such as site selection, trade area analysis, competitive intelligence and more\nAzira serves enterprises in retail, hospitality, travel, real estate, financial services and media\nA global company, Azira is headquartered in Los Angeles with offices in Paris, Bangalore, Singapore, Sydney, and Tokyo\nTo learn more, please visit https://azira com\nShow more Show less",
    "Job Title": "Data Scientist",
    "Location": "Bengaluru",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T17:52:28.786Z",
    "Search Experience": "1",
    "Search Location": "Bangalore",
    "Search Query": "Data Analyst",
    "Skills": "data extraction, python, data analysis, microsoft azure, machine learning, programming, sql",
    "firstScraped": "2025-05-04T18:00:33.539Z",
    "lastUpdated": "2025-05-04T18:00:33.539Z"
  },
  {
    "_id": "6817ab41f8e721138d29a384",
    "Job URL": "https://www.naukri.com/job-listings-associate-healthcare-research-data-analyst-clarivate-analytics-noida-bengaluru-0-to-2-years-010425500397",
    "Application Type": "External",
    "Company Name": "Clarivate",
    "Experience Required": "0-2 Yrs",
    "Job Description": "We are looking for an Associate Analyst to join our Life Science and Healthcare (Infectious, Niche, and Rare Disease) team in Noida. We have great skill set in market research and assessment, analysis and insights and we would love to speak with you if you have skills in pharmaceutical market research.\nAbout You - experience, education, skills, and accomplishments\nMaster s degree in pharmacy / life sciences / pharmaceutical management is required.\nRelevant experience of 0-1 years in the biopharma, healthcare or market research is required. Global experience and experience in directly working with global stakeholders is preferable.",
    "Job Title": "Associate Healthcare Research & Data Analyst",
    "Location": "Bengaluru, Noida",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T17:51:52.522Z",
    "Search Experience": "1",
    "Search Location": "Bangalore",
    "Search Query": "Data Analyst",
    "Skills": "Primary market research, Data analysis, Associate Analyst, Primary research, Pharma, Healthcare, Life sciences, Forecasting, clinical data",
    "firstScraped": "2025-05-04T18:00:33.539Z",
    "lastUpdated": "2025-05-04T18:00:33.539Z"
  },
  {
    "_id": "6817ab41f8e721138d29a383",
    "Job URL": "https://www.naukri.com/job-listings-hiring-data-analyst-reporting-forecasting-join-a-global-insurance-co-rivera-manpower-services-bengaluru-0-to-1-years-220425011797",
    "Application Type": "Internal",
    "Company Name": "Rivera Manpower",
    "Experience Required": "0-1 Yrs",
    "Job Description": "Hiring: Financial Benefit Associate (Fresher) Join a Global Insurance Leader!\n\nLocation: Bangalore\nCompany: Global Insurance Leader!\nCall and book your interview slots: 9986267393 / 7829336034 /7829336202\n\nPowered by: Rivera Manpower Services\n\nWarm Greetings from Rivera Manpower!\nWe are hiring freshers for the role of Financial Benefit Associate one of the worlds leading insurance brokerage firms. If you're someone with a keen eye for detail, excellent analytical skills, and a passion for data-driven insights this is your chance to kickstart your career in a global environment!\n\nNote : We are Hiring Only hiring BSC(maths / MSC Statistics\n\nRole Overview:\nAs a Financial Benefit Associate, you will:\nSupport the insurance team with reporting, forecasting, and renewal tasks.\nAnalyze financial data from Employee Benefit Plans.\nPrepare strategic insights for account management teams and clients.\nCollaborate with global teams and ensure timely, high-quality deliverables.\nWork with MS Excel, VBA, and applied statistics.\nWhat Were Looking For:\nExcellent communication skills\nStrong in MS Excel & VBA\nGood understanding of Applied Statistics\nEye for detail and ability to handle multiple tasks under tight deadlines\nEducational Qualification: M.Sc. in Statistics / Applied Math (preferred)\nCall now and book your interview slot:\n9986267393 / 7829336034\n\nFreshers Welcome | Grow your career with a global brand | Global exposure",
    "Job Title": "Hiring Data Analyst- Reporting/Forecasting!!Join a Global Insurance Co",
    "Location": "Bengaluru",
    "Salary": "4.5-5.5 Lacs PA",
    "Scraped Date": "2025-05-04T17:51:44.733Z",
    "Search Experience": "1",
    "Search Location": "Bangalore",
    "Search Query": "Data Analyst",
    "Skills": "forecasting, Data Analysis, Analytics Reporting, macros, Power Bi, Data Extraction, Statistical Data Analysis, Tableau, sql, Business Reporting, Reporting Analysis, vba, Data Visualization, Statistical Analyses, Reporting And Analytics, Data Reporting, reporting, stati",
    "firstScraped": "2025-05-04T18:00:33.539Z",
    "lastUpdated": "2025-05-04T18:00:33.539Z"
  },
  {
    "_id": "6817ab41f8e721138d29a382",
    "Job URL": "https://www.naukri.com/job-listings-data-analyst-renaissance-technologies-private-limited-gurugram-bengaluru-mumbai-all-areas-0-to-4-years-290425019440",
    "Application Type": "Internal",
    "Company Name": "Renaissance Technologies Private Limited",
    "Experience Required": "0-4 Yrs",
    "Job Description": "Role & responsibilities\nUsing statistical methods to analyze data and generate reports.\nConstructing and putting into use databases and data collection systems.\nCollecting information from primary and secondary sources and keeping data systems up to date.\nThe process of spotting, examining, and deciphering trends or patterns in large, complex datasets.\nData cleaning and filtering.\nPrioritizing business and information needs in collaboration with management.\nIdentifying and locating new opportunities for process improvement.\n\nPreferred candidate profile\n\nTechnical skills: Proficiency in tools like Adobe, Python, Google Analytics, MS Office, SQL, Power Bl, and Tableau\nAnalytical skills: Strong analytical ability, and the ability to analyze data and sales statistics\nCommunication skills: Excellent interpersonal relationship skills\nTime management: Ability to multitask, prioritize, and manage time efficiently\nLearning agility: Effective time management and learning agility\nProgramming skills: Ability to write scalable code using Python programming language\nExperience: Experience in data analysis, dashboard management, and preparation of business reports\n\nPerks and benefits\n\nHealth & wellness programs\nFlexible work schedule\nHSA & FSA plans\nHealth benefits\nLife insurance",
    "Job Title": "Data Analyst",
    "Location": "Hybrid - Mumbai (All Areas), Bengaluru, Gurugram",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T17:51:36.571Z",
    "Search Experience": "1",
    "Search Location": "Bangalore",
    "Search Query": "Data Analyst",
    "Skills": "Power Bi, Python, SQL, Data Manipulation, Tableau, Data Reporting, Analytics Reporting, Bi",
    "firstScraped": "2025-05-04T18:00:33.539Z",
    "lastUpdated": "2025-05-04T18:00:33.539Z"
  },
  {
    "_id": "6817ab41f8e721138d29a381",
    "Job URL": "https://www.naukri.com/job-listings-online-data-analysts-multiple-languages-telus-digital-bengaluru-0-to-5-years-150425016649",
    "Application Type": "Internal",
    "Company Name": "TELUS Digital",
    "Experience Required": "0-5 Yrs",
    "Job Description": "Are you a detail-oriented individual with a passion for research and a good understanding of national and local geography? This freelance opportunity allows you to work at your own pace and from the comfort of your own home.\n\nA Day in the Life of an Online Data Analyst:\nIn this role, you will be working on a project aimed at enhancing the content and quality of digital maps that are used by millions of people worldwide",
    "Job Title": "Online Data Analysts (Multiple Languages)",
    "Location": "Remote",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T17:50:59.829Z",
    "Search Experience": "1",
    "Search Location": "Bangalore",
    "Search Query": "Data Analyst",
    "Skills": "English, Oriya, Geography, Malayalam, Social Media, Urdu, Marathi, Odia, Media, Bengali, Gujarati, Kannada, Maps, News, Search Engine, Punjabi, Business, Sports",
    "firstScraped": "2025-05-04T18:00:33.539Z",
    "lastUpdated": "2025-05-04T18:00:33.539Z"
  },
  {
    "_id": "6817ab41f8e721138d29a380",
    "Job URL": "https://www.naukri.com/job-listings-tariff-data-analyst-innover-digital-bengaluru-0-to-5-years-010525502902",
    "Application Type": "External",
    "Company Name": "Innover Digital",
    "Experience Required": "0-5 Yrs",
    "Job Description": "Analyzes and reviews Operations key performance indicators to identify opportunities for improvement, determine root cause, and develop plans to resolve; leads execution of the resolution.\nData Analytic gathering to support tariff mitigation policies and procedures; including preferred methods and measurements, processes, costs, supplier quality control.\nUnderstand and then design the routing requirements in a Global Trade Management Systems.\nProvides knowledge and direction on the ways multiple Trade operations and visibility systems interact. Guide the daily planning team accordingly.\nLeads analytics for Trade Operations to support tariff mitigation.\nFacilitates ongoing efficiency improvements.\nEvaluates model flow results and makes recommendations for improvement.\nResearches and recommends continuous improvement opportunities for the operation based on external bench marking and industry best practices.\nResponsible for the Transportation program governing all aspects of our import and export activity. Includes supervising Logistics team members and their daily activity.\nResponsible for the accuracy of shipment data; including product documentation; to partner with our Trade Operations and Supply Chain teams to proactively address compliance issues.\n\nQualifications:\n\nBachelors Degree or equivalent experience\n5+ yrs. experience\nExperience with installing efficiency improvements.\nTrade Management Systems use preferred.\nGlobal Trade Experience preferred.\nProven understanding of statistics and strong analytic skills\nKnowledge of LEAN Six Sigma principles and standard project management processes\nIntuitive ability to recognize innovative opportunities.\nExpertise in Microsoft Office programs.\nExcellent communication skills; written and verbal communication skills.\nInterpersonal skills to deal with all levels of the organization",
    "Job Title": "TARIFF DATA ANALYST",
    "Location": "Bengaluru",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T17:50:50.686Z",
    "Search Experience": "1",
    "Search Location": "Bangalore",
    "Search Query": "Data Analyst",
    "Skills": "Supply chain, IT services, Trade, Management systems, Project management, Data Analyst, trade operations, Continuous improvement, Analytics, Logistics",
    "firstScraped": "2025-05-04T18:00:33.539Z",
    "lastUpdated": "2025-05-04T18:00:33.539Z"
  },
  {
    "_id": "68171a45f8e721138d29a2c7",
    "Job URL": "https://www.naukri.com/job-listings-erp-software-engineer-mastersoft-erp-solutions-mumbai-all-areas-0-to-3-years-310325005720",
    "Application Type": "Internal",
    "Company Name": "Mastersoft Erp Solutions",
    "Experience Required": "0-3 Yrs",
    "Job Description": "Understand the project by considering every aspect of each module of ERP\nImplementation of project at client site\nTraining of users according to modules\nOnsite support to clients\n\nRequired Candidate profile\nExcellent communication skills.\nExperience in software Implementation (Preferred).\nMale candidates are preferred.",
    "Job Title": "ERP Software Engineer",
    "Location": "Mumbai (All Areas)",
    "Salary": "2.5-5 Lacs PA",
    "Scraped Date": "2025-05-04T07:40:38.783Z",
    "Search Experience": "0",
    "Search Location": "Mumbai",
    "Search Query": "Software Engineer",
    "Skills": "Communication Skills, Customer Support, ERP Implementation, Technical Support, Presentable, Technical, Software, ERP",
    "firstScraped": "2025-05-04T07:41:57.146Z",
    "lastUpdated": "2025-05-04T07:41:57.146Z"
  },
  {
    "_id": "68171a45f8e721138d29a2c6",
    "Job URL": "https://www.naukri.com/job-listings-tr-as-software-engineer-mern-stack-logixal-cloud-solutions-mumbai-all-areas-0-to-2-years-020525017985",
    "Application Type": "Internal",
    "Company Name": "Logixal Cloud Solutions",
    "Experience Required": "0-2 Yrs",
    "Job Description": "App development on UI platform using React-Typescript-JavaScript\nBackend development using Node/ExpressJS\nCreating & Consuming SOAP/RESTful webservices\nStrong fundamentals  OOPS concepts, Exception Handling, Coding Standards\nWorking in SDLC/Agile\n\nRequired Candidate profile\nTech graduate with Min 6 months exp in UI using JS, ReactJS & Typescript\nHands on exp in Node/ExpressJS\nExcellent analytical skills\nExp in NextJS would be an added advantage\n\nCan join immediately",
    "Job Title": "Tr/As Software Engineer (MERN Stack)",
    "Location": "Mumbai (All Areas)",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T07:37:45.762Z",
    "Search Experience": "0",
    "Search Location": "Mumbai",
    "Search Query": "Software Engineer",
    "Skills": "Typescript, Javascript, Node.Js, React.Js, Mern Stack, Software engineering, Tr, As",
    "firstScraped": "2025-05-04T07:41:57.146Z",
    "lastUpdated": "2025-05-04T07:41:57.146Z"
  },
  {
    "_id": "68171a45f8e721138d29a2c5",
    "Job URL": "https://www.naukri.com/job-listings-software-engineer-balasundaram-santosh-pune-chennai-mumbai-all-areas-0-to-5-years-040824001469",
    "Application Type": "Internal",
    "Company Name": "Leading IT Company",
    "Experience Required": "0-5 Yrs",
    "Job Description": "Develop and maintain web applications.\nCollaborate with teams to design, develop, and deploy new features.\nDebug and troubleshoot issues.\nStrong problem-solving skills and attention to detail.\nFreshers & Experienced can apply.",
    "Job Title": "Software Engineer",
    "Location": "Pune, Chennai, Mumbai (All Areas)",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T07:32:46.485Z",
    "Search Experience": "0",
    "Search Location": "Mumbai",
    "Search Query": "Software Engineer",
    "Skills": "Software Development, Software Engineering, CSS, Software Testing, Software Life Cycle, PHP, Nextjs, Software Programming, Software Solutions, Python, SQL",
    "firstScraped": "2025-05-04T07:41:57.146Z",
    "lastUpdated": "2025-05-04T07:41:57.146Z"
  },
  {
    "_id": "68171a45f8e721138d29a2c4",
    "Job URL": "https://www.naukri.com/job-listings-software-engineer-zeki-software-solutions-pvt-ltd-mumbai-0-to-3-years-211222501676",
    "Application Type": "External",
    "Company Name": "Zeki Software",
    "Experience Required": "0-3 Yrs",
    "Job Description": "Working Knowledge in web technologies and MYSQL ( HTML 5, CSS 3, Java Script, JQuery)\nWorking Knowledge in Tomcat and WildFly web server is needed. .\nFresher with good knowledge of OOPs and MySQL.\nMust be able to write - clean, well designed code.\nGood Analytical and Communication skills is a must.\nSkills\nJava\nJSP\nServlet\nStruts\nJDBC\nOracle/MySql\nAjax",
    "Job Title": "Software Engineer",
    "Location": "Mumbai",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T07:31:26.074Z",
    "Search Experience": "0",
    "Search Location": "Mumbai",
    "Search Query": "Software Engineer",
    "Skills": "Object oriented design, Tomcat, jQuery, JSP, Analytical, MySQL, Struts, JDBC, Oracle, Ajax",
    "firstScraped": "2025-05-04T07:41:57.146Z",
    "lastUpdated": "2025-05-04T07:41:57.146Z"
  },
  {
    "_id": "68171a45f8e721138d29a2c3",
    "Job URL": "https://www.naukri.com/job-listings-software-engineer-zeki-software-solutions-pvt-ltd-mumbai-0-to-3-years-211222501679",
    "Application Type": "External",
    "Company Name": "Zeki Software",
    "Experience Required": "0-3 Yrs",
    "Job Description": "working Knowledge in web technologies and MYSQL ( HTML 5, CSS 3, Java Script, JQuery)\nFresher with good knowledge of OOPs and MySQL.\nBasic understanding of front-end/UI technologies.\nMust be able to write - clean, well designed code.\nGood Analytical and Communication skills is a must.\nDevelop a deep understanding of integration and dependencies with other systems and platforms within the architecture landscape.\nSkills\nPHP\nHTML\nCSS\nJQUERY\nMySql\nAjax\nJavascript",
    "Job Title": "Software Engineer",
    "Location": "Mumbai",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T07:31:18.188Z",
    "Search Experience": "0",
    "Search Location": "Mumbai",
    "Search Query": "Software Engineer",
    "Skills": "CSS, jQuery, Front end, Web technologies, Analytical, MySQL, Javascript, PHP, HTML, Ajax",
    "firstScraped": "2025-05-04T07:41:57.146Z",
    "lastUpdated": "2025-05-04T07:41:57.146Z"
  },
  {
    "_id": "68171a45f8e721138d29a2c2",
    "Job URL": "https://www.naukri.com/job-listings-software-engineer-voice-ai-kannada-soundhound-kolkata-mumbai-new-delhi-hyderabad-pune-chennai-bengaluru-0-to-3-years-050225503611",
    "Application Type": "External",
    "Company Name": "Soundhound",
    "Experience Required": "0-3 Yrs",
    "Job Description": "We are looking for a Software Engineer with native-level proficiency in speaking Kannada and an interest in creating user-friendly VoiceAI products using C++. You will learn and apply the most advanced technologies in the fields of Natural Language Processing (NLP), Natural Language Understanding (NLU), Natural Language Generation (NLG), speech, and search, all built in-house at SoundHound. Prior experience in these specialized fields is not required.\n  In this role, you will:\nSimultaneously leverage your coding skills and your knowledge of the Kannada language\nDevelop Conversational AI leveraging a powerful domain-oriented development paradigm\nImplement and scale core code base, solving both algorithmic and design challenges\nWrite code that interacts with third-party API s\nCollaborate closely with engineers who are building similar features for a variety of languages\nWe would love to hear from you if:\nYou have a Bachelors Degree in Computer Science and at least 2 years of experience as a Software Engineer OR a Master s Degree in Computer Science\nYou have excellent coding skills in C++ and at least one scripting language\nYou design unit and integration tests and maintain rigorous standards for code quality\nYou speak Kannada on a native-like level and are fluent in English\nYou are passionate about working at the intersection of software engineering and linguistics\nYou have experience designing efficient architectures, algorithms, and interfaces\nYou enjoy working on complex, open-ended challenges and improving existing solutions\nYou re comfortable working in a Linux environment\nWe d be especially excited if you have built chatbots or voice assistants or have experience with NLP algorithms",
    "Job Title": "Software Engineer, Voice AI (Kannada)",
    "Location": "Hyderabad, Pune, Chennai, Mumbai, Bengaluru, Kolkata, New Delhi",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T07:31:10.150Z",
    "Search Experience": "0",
    "Search Location": "Mumbai",
    "Search Query": "Software Engineer",
    "Skills": "C++, Linux, Coding, Linguistics, HTML, Natural language processing, Customer service, Process",
    "firstScraped": "2025-05-04T07:41:57.146Z",
    "lastUpdated": "2025-05-04T07:41:57.146Z"
  },
  {
    "_id": "68171a45f8e721138d29a2c1",
    "Job URL": "https://www.naukri.com/job-listings-ai-software-engineer-godigi-infotech-mumbai-new-delhi-pune-bengaluru-0-to-1-years-100524500130",
    "Application Type": "External",
    "Company Name": "Godigi Infotech",
    "Experience Required": "0-1 Yrs",
    "Job Description": "We are on the lookout for a passionate Artificial Intelligence Engineer to be a part of our dynamic team.In this role, your curiosity and deep interest in AI, machine learning, and keeping pace with a rapidly evolving field will guide your path. You will delve into extensive data sets, identify patterns, and craft predictive algorithmic models, contributing to innovative projects.\nIf your a tech-savvy innovator with a drive to make a significant impact in the realm of AI, were eager for you to bring your talents to our team\n  AI Engineer Responsibilities\nDesign and develop cutting-edge AI solutions and systems that integrate with our products and services\nCollaborate with cross-functional teams to assess business needs and identify opportunities for AI solutions\nImplement and maintain AI models, algorithms, and tools\nConduct research and experiments to improve the performance of AI systems\nDevelop and maintain documentation for AI models and algorithms\nMonitor the performance of AI systems and make recommendations for improvements\nStay up-to-date with advancements in AI technologies and make recommendations for future development\nAI Engineer Requirements and Skills\nBachelors degree in Computer Science, Engineering, or a related field\nExperience in developing and deploying AI solutions\nProven track record of designing and implementing complex machine learning algorithms and models\nStrong programming skills in Python, R, MATLAB, or other relevant programming language\nExperience working with large datasets and data pre-processing techniques\nStrong problem-solving and analytical skills\nExcellent communication and collaboration skills",
    "Job Title": "AI Software Engineer",
    "Location": "Pune, Mumbai, Bengaluru, New Delhi",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T07:30:34.068Z",
    "Search Experience": "0",
    "Search Location": "Mumbai",
    "Search Query": "Software Engineer",
    "Skills": "Analytical skills, C++, Artificial Intelligence, Machine learning, Programming, Javascript, PHP, MATLAB, Python",
    "firstScraped": "2025-05-04T07:41:57.146Z",
    "lastUpdated": "2025-05-04T07:41:57.146Z"
  },
  {
    "_id": "68171a45f8e721138d29a2c0",
    "Job URL": "https://www.naukri.com/job-listings-software-engineer-scribble-data-kolkata-mumbai-new-delhi-hyderabad-pune-chennai-bengaluru-0-to-1-years-010323500468",
    "Application Type": "External",
    "Company Name": "Scribble Data",
    "Experience Required": "0-1 Yrs",
    "Job Description": "We are searching for a strong software engineer with a data engineering bent of mind to work on our flagship feature store product, Enrich. You will work on extending functionality for Enrich as well as delivering working systems atop Enrich for Scribble s customers with high attention-to-detail ensuring trust, robustness, performance, and ease of use. Here are all the details you ll need, to see if we can work together:\n\nYou will develop high-performance data processing systems for dealing with internet-scale data.\nYou will develop and deploy robust, distributed, scalable, real-time, data processing infrastructure that can support various downstream applications including reporting, analytics, user intelligence, machine learning, and decision support.\nYou have strong software engineering skills, system-level thinking and problem-solving ability paired with the love to build and ship robust code.\nYou accept nothing less than top-quality code and think in terms of code reviews, unit, integration, end to end tests in a fast-moving development environment, delivering incremental value daily.\n\nYour Strengths\n5 years industry experience; plus points if any of those were spent building data infrastructure\nFluent in Python; you know the language and its quirks, not having just written scripts\nStrong command of SQL\nStrong understanding of computer science concepts (OOD, algorithm design, data structures, execution and memory optimization)\nExperience developing and publishing APIs using web services\nPlus points for experience implementing systems for data workflow management\nBachelors/Masters in Computer Science\n\nNice to Have\nExperience using at least some among distributed storage (e.g. S3), serverless architecture (e.g. Lambda), streaming data (e.g. Kafka), scalable search (e.g. Elasticsearch)\nExperience with big data technologies like map-reduce, NoSQL, Spark, HBase, Hive\nExperience with data security protocols and data access controls\n\nDoes this sound like you?\nYou like adventure and have a stomach for learning and unlearning every day\nYou are excited by powering up a whole generation of upcoming data applications\nYou dream big and believe that hard problems need streamlined systems and massive amounts of data to tackle effectively\nYou embrace uncertainty and can develop processes and systems to handle rapidly evolving requirements\nYou have a sense of humour",
    "Job Title": "Software Engineer",
    "Location": "Hyderabad, Pune, Chennai, Mumbai, Bengaluru, Kolkata, New Delhi",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T07:30:26.166Z",
    "Search Experience": "0",
    "Search Location": "Mumbai",
    "Search Query": "Software Engineer",
    "Skills": "metadata, Publishing, data security, Machine learning, Data structures, Analytics, SQL, Python, HBase",
    "firstScraped": "2025-05-04T07:41:57.146Z",
    "lastUpdated": "2025-05-04T07:41:57.146Z"
  }
]
